{
    "1": {
        "style": "التجنب",
        "description": "التجنب هو أسلوب إدارة الصراعات حيث يتجنب الأفراد معالجة الصراع، على أمل أن يتم حله من تلقاء نفسه دون مواجهة.",
        "dos": [
            "استخدم التجنب عندما تكون المشكلة بسيطة ولا تستحق التصعيد.",
            "اختر التجنب إذا كانت المشاعر مرتفعة للغاية بحيث لا يمكن إجراء محادثة مثمرة.",
            "تجنب الصراع عندما يكون التوقيت غير مناسب أو تحتاج إلى مزيد من الوقت للتفكير.",
            "استخدم التجنب عندما تحتاج إلى التهدئة واكتساب منظور جديد.",
            "تراجع عند التعامل مع المواقف الحساسة للغاية أو المتقلبة حيث قد يكون المواجهة الفورية ضارة."
        ],
        "donts": [
            "لا تستخدم التجنب للهروب من القضايا الخطيرة التي تحتاج إلى معالجة.",
            "تجنب استخدام التجنب كحل طويل الأمد، حيث يمكن أن يؤدي إلى توترات غير محلولة.",
            "لا تتجاهل مشاعر شريكك بتجاهل الصراعات التي تهمه.",
            "لا تتجنب جميع أشكال المواجهة، حيث يمكن أن يؤدي ذلك إلى خلق مسافة واستياء.",
            "تجنب الصمت، حيث يمكن أن يزيد من الضغط العاطفي وسوء الفهم."
        ],
        "howToCommunicate": [
            "أخبر شريكك أنك بحاجة إلى وقت لمعالجة مشاعرك قبل مناقشة الصراع.",
            "وضح أن تجنبك للمشكلة في الوقت الحالي هو طريقتك لضمان عدم تصعيد الجدال.",
            "طمئنه أنك تنوي معالجة المشكلة عندما تكون مستعدًا للتعامل معها بهدوء.",
            "اشرح أنك لا تتجاهل مخاوفه، ولكنك تحتاج إلى بعض المساحة لجمع أفكارك.",
            "حدد موعدًا لمراجعة المحادثة، موضحًا أن التجنب مؤقت."
        ],
        "commonMisunderstandings": [
            "غالبًا ما يعتقد الناس أن التجنب يعني تجاهل المشكلة تمامًا، ولكنه يمكن أن يكون استراتيجية للتهدئة.",
            "يُنظر إلى التجنب على أنه نقص في الاهتمام، لكنه يمكن أن يكون وسيلة لتجنب الصراعات غير الضرورية.",
            "يعتقد البعض أن التجنب يؤدي دائمًا إلى مشاكل غير محلولة، ولكنه يمكن أن يوفر مساحة للتفكير بوضوح.",
            "قد يسيء الشركاء فهم التجنب على أنه عدم اهتمام، في حين أنه قد يكون وسيلة لإدارة الصراع.",
            "يمكن أن يُنظر إليه على أنه انفصال عاطفي، في حين أن التجنب يمكن أن يكون وسيلة للحفاظ على الذات في اللحظات المجهدة."
        ],
        "tips": [
            "استخدم التجنب بشكل استراتيجي - تأكد من مراجعة المشكلة عندما تكون مستعدًا للتعامل معها بهدوء.",
            "تواصل بصراحة حول سبب اختيارك لتجنب الصراع مؤقتًا.",
            "كن واعيًا لاحتياج شريكك لحل المشكلة ولا تتركه في الظلام لفترة طويلة.",
            "ابحث عن منافذ صحية لمعالجة مشاعرك، مثل كتابة اليوميات أو التحدث إلى شخص ثالث محايد.",
            "يعمل التجنب بشكل أفضل عند دمجه مع الالتزام بمعالجة المشكلة في وقت لاحق أكثر ملاءمة."
        ],
        "examples": [
            "الابتعاد عن الجدال عندما تكون المشاعر مرتفعة واقترح إعادة مناقشة المحادثة لاحقًا.",
            "إذا قام شريكك بطرح مشكلة في وقت مرهق، أوضح أنك تفضل مناقشتها عندما تكونان أكثر هدوءًا.",
            "الابتعاد عن جدال عائلي محتدم لتجنب تصعيد الموقف.",
            "الامتناع عن مواجهة زميل في العمل بشأن إزعاج صغير، واختيار التغاضي عنه.",
            "تجنب ذكر مشكلة بسيطة عندما تعلم أن شريكك بالفعل مثقل بأشياء أخرى."
        ]
    },
    "2": {
        "style": "التكيف",
        "description": "الاستيعاب هو أسلوب إدارة الصراع حيث يتنازل شخص ما عن رغباته أو احتياجاته من أجل الحفاظ على السلام وتجنب الصراع.",
        "dos": [
            "استخدم الاستيعاب عندما تكون المشكلة بسيطة وتفضل العلاقة على أن تكون على حق.",
            "استوعب شريكك عندما يشعر بقوة تجاه شيء ما وتكون على استعداد للتنازل.",
            "اختر الاستيعاب لتهدئة الوضع والحفاظ على الانسجام، خاصة في اللحظات الحامية.",
            "أظهر الاستيعاب عندما يحتاج شريكك إلى الدعم ويمكنك التخلي عن المشكلة.",
            "كن مرنًا في استيعاب تفضيلات شريكك لتعزيز العلاقة."
        ],
        "donts": [
            "لا تتنازل عن احتياجاتك أو مشاعرك مما قد يؤدي إلى استياء.",
            "تجنب جعل الاستيعاب هو طريقتك الافتراضية، حيث قد يمنعك ذلك من التعبير عن مخاوفك.",
            "لا تستسلم إذا كانت القضية مهمة لرفاهيتك أو سعادتك على المدى الطويل.",
            "امتنع عن الاستيعاب لتجنب جميع الصراعات، حيث يمكن أن يؤدي ذلك إلى خلل في العلاقة.",
            "تجنب التظاهر بالموافقة فقط لتجنب المواجهة."
        ],
        "howToCommunicate": [
            "أخبر شريكك أنك على استعداد لاستيعاب احتياجاته لأنك تقدر سعادته.",
            "وضح أنه رغم أنك على استعداد لتجاوز هذه المشكلة، فإنك تقدر التفاهم المتبادل في المستقبل.",
            "تواصل أن استيعاب رغباته الآن لا يعني أنك ستفعل ذلك دائمًا – يعتمد على الموقف.",
            "طمئن شريكك أن الاستيعاب لا يعني الاستسلام، بل يتعلق بإيجاد توازن في اللحظة.",
            "أخبر شريكك عندما تستوعب لأن المشكلة ليست بنفس أهمية احتياجاته."
        ],
        "commonMisunderstandings": [
            "غالبًا ما يعتقد الناس أن الاستيعاب يعني دائمًا أن تكون ضعيفًا، لكنه يتعلق باختيار معاركك.",
            "الاستيعاب يُفهم بشكل خاطئ على أنه علامة على الضعف، ولكنه يمكن أن يظهر الذكاء العاطفي.",
            "يعتقد البعض أن الاستيعاب يعني أنك لا تهتم باحتياجاتك الخاصة، لكنه يمكن أن يكون عملًا غير أناني من الحب.",
            "قد يسيء الشركاء فهم الاستيعاب على أنه تجنب للقضية، لكنه يتعلق بتحديد أولويات الانسجام في العلاقة.",
            "قد يفترض الناس أن الاستيعاب يعني أنك لا تملك آراء قوية، بينما أنت في الواقع تختار السلام على المواجهة."
        ],
        "tips": [
            "استخدم الاستيعاب عندما تكون العلاقة أكثر أهمية من الفوز في الجدال.",
            "كن واضحًا بشأن سبب استيعابك لتجنب الشعور بالاستياء لاحقًا.",
            "تأكد من تحقيق التوازن بين الاستيعاب ولحظات تأكيد احتياجاتك الخاصة.",
            "مارس الاستيعاب في المواقف التي يشعر فيها التنازل بأنه معقول وعادل.",
            "تحقق من نفسك للتأكد من أنك لا تستوعب خوفًا من الصراع."
        ],
        "examples": [
            "وافق على مشاهدة فيلم شريكك المفضل، حتى لو لم يكن اختيارك الأول.",
            "دع شريكك يختار وجهة الإجازة لأنها تهمه أكثر.",
            "استوعب اختيار شريكك للعشاء، حتى لو لم يكن مطعمك المفضل.",
            "تنازل عن رأيك في نقاش صغير للحفاظ على السلام.",
            "اتفق على إعادة ترتيب خطط عطلة نهاية الأسبوع لدعم احتياجات شريكك."
        ]
    },
    "3": {
        "style": "التسوية",
        "description": "التسوية هي أسلوب إدارة الصراع حيث يتنازل كلا الطرفين لإيجاد حل وسط والوصول إلى اتفاق يرضي الطرفين إلى حد ما.",
        "dos": [
            "استخدم التسوية عندما يكون لدى كلا الطرفين نقاط صحيحة ومن المهم إيجاد حل عادل.",
            "اقترح تقسيم الفروق أو تقسيم المسؤوليات للوصول إلى حل وسط.",
            "شجع على العطاء والأخذ، مما يسمح لكلا الطرفين بالشعور بالاستماع والاحترام.",
            "اقترح التسوية في المواقف التي يكون فيها كلاكما مرنًا ومستعدًا لتقديم التضحيات.",
            "اسعَ إلى حلول يخرج فيها كلا الطرفين من النقاش بشعور بالرضا عن النتيجة."
        ],
        "donts": [
            "لا تستخدم التسوية كطريقة لتجنب النقاشات العميقة أو الصراعات الضرورية.",
            "تجنب التنازل عن القيم أو المبادئ الأساسية التي تهمك.",
            "لا تقترح التسوية عندما يشعر أحد الأطراف بعدم الرضا بشكل كبير.",
            "لا تتعامل مع التسوية كحل سريع دون النظر بجدية إلى الجانبين.",
            "تجنب استخدام التسوية كطريقة للهروب من المسؤولية أو المحاسبة."
        ],
        "howToCommunicate": [
            "أخبر شريكك أنك منفتح على إيجاد حل وسط يناسب كليكما.",
            "اشرح أنه على الرغم من استعدادك للتنازل عن شيء ما، إلا أنك ترغب في أن يفعل الشيء نفسه لتحقيق التوازن.",
            "تواصل أن التسوية تتعلق بالعدالة، وتقدر كلا المنظورين على قدم المساواة.",
            "طمئن شريكك أنك ملتزم بإيجاد حل يفيد كليكما.",
            "اقترح مجالات يمكن لكليكما تقديم تنازلات فيها للوصول إلى نصف الطريق."
        ],
        "commonMisunderstandings": [
            "قد يعتقد الناس أن التسوية تعني دائمًا 50/50، لكنها يمكن أن تختلف حسب الموقف.",
            "يُنظر إلى التسوية على أنها حل ضعيف، لكنها تتعلق بالعدالة والتوازن.",
            "يعتقد البعض أن التسوية تعني أن كلا الطرفين لا يحصلان على ما يريدانه، لكنها تتعلق بالرضا المتبادل.",
            "غالبًا ما يُفهم أن التسوية تتعلق بالتنازل، عندما يتعلق الأمر بخلق الانسجام.",
            "قد يعتقد الشركاء أن التسوية تفيد جانبًا واحدًا فقط، ولكن عندما تُنفذ بشكل صحيح، يجب أن يشعر كلا الطرفين بالرضا."
        ],
        "tips": [
            "كن مستعدًا للتخلي عن التفضيلات الصغيرة لتحقيق نتيجة أكبر وأكثر انسجامًا.",
            "تأكد من أن كلا الطرفين يسمعان ويحترمان قبل اقتراح التسوية.",
            "ابحث عن حلول يخرج فيها كلا الطرفين بشعور بالاحترام.",
            "استخدم التسوية في المواقف التي تكون فيها المرونة ممكنة دون التضحية بالاحتياجات الأساسية.",
            "كن واعيًا أن التسوية لا تحتاج دائمًا إلى أن تكون متساوية - الأمر يتعلق بإيجاد ما يناسب الطرفين."
        ],
        "examples": [
            "اقترح تقسيم الوقت بين وجهتين للعطلات إذا كان لديك أنت وشريكك تفضيلات مختلفة.",
            "وافق على مشاهدة فيلم لا تحبه، لكن اختر الفيلم التالي معًا.",
            "تنازل عن ميزانية حيث يقدم كلا الطرفين تضحيات صغيرة لاستيعاب الأهداف المشتركة.",
            "اتفق على قضاء الوقت مع العائلتين خلال العطلات بدلاً من اختيار واحدة فقط.",
            "اقترح تبادل المهام أو المسؤوليات لتحقيق التوازن في عبء العمل في المنزل."
        ]
    },
    "4": {
        "style": "التعاون",
        "description": "التعاون هو أسلوب إدارة الصراع حيث يعمل كلا الطرفين معًا لإيجاد حل يكسب فيه الجميع ويلبي تمامًا احتياجات كلا الفردين.",
        "dos": [
            "استخدم التعاون عندما يكون كلا الطرفين ملتزمين بإيجاد أفضل نتيجة ممكنة.",
            "تعاون عندما يكون الصراع معقدًا ويتطلب مدخلات من كلا الجانبين لتحقيق حل ناجح.",
            "شجع على التواصل المفتوح حيث يشعر كلا الطرفين بالأمان للتعبير عن احتياجاتهما ورغباتهما.",
            "ابحث عن حلول تعالج بالكامل مخاوف كلا الطرفين.",
            "اجعل العمل الجماعي أولوية لخلق نتيجة تفيد الجانبين بالتساوي."
        ],
        "donts": [
            "لا تستخدم التعاون إذا كان أحد الطرفين غير مستعد للتنازل أو التواصل بصراحة.",
            "تجنب التعاون في المواقف الحساسة زمنياً حيث تكون هناك حاجة إلى قرار سريع.",
            "لا تدع عملية التعاون تصبح معقدة أو طويلة بشكل مفرط.",
            "تجنب التعاون إذا شعر أحد الطرفين بأنه يجب أن يتنازل كثيرًا من أجل الآخر.",
            "تجنب استخدام التعاون إذا شعر أي من الطرفين أن احتياجاته الأساسية يتم تجاهلها."
        ],
        "howToCommunicate": [
            "أخبر شريكك أنك تريد العمل معًا لإيجاد حل يرضي كلاكما.",
            "عبر عن انفتاحك لسماع أفكاره ومخاوفه قبل اتخاذ أي قرارات.",
            "طمئن شريكك أن التعاون يتعلق بالعمل الجماعي وضمان رضا الطرفين عن النتيجة.",
            "تواصل مع استعدادك لاستكشاف خيارات متعددة للوصول إلى اتفاق مشترك.",
            "شجع على العصف الذهني وحل المشكلات كوسيلة لمعالجة القضية من جميع الزوايا."
        ],
        "commonMisunderstandings": [
            "غالبًا ما يعتقد الناس أن التعاون يستغرق وقتًا طويلاً، لكنه يمكن أن يؤدي إلى حلول دائمة.",
            "يُفهم التعاون بشكل خاطئ على أنه تسوية، ولكنه يتعلق بإيجاد أفضل حل دون التضحية بالاحتياجات الأساسية.",
            "يعتقد البعض أن التعاون يعمل فقط في المواقف المثالية، ولكنه يمكن أن يكون فعالًا في العديد من أنواع الصراعات.",
            "قد يعتقد الشركاء أن التعاون يتطلب جهدًا كبيرًا، لكنه غالبًا ما يؤدي إلى نتائج أكثر إرضاءً.",
            "يُفترض غالبًا أن التعاون يعني أن كلا الطرفين يجب أن يتفقا بنسبة 100٪، لكنه يتعلق أكثر بالرضا المتبادل."
        ],
        "tips": [
            "اقترب من التعاون بعقلية الفضول وحل المشكلات.",
            "ركز على الاستماع النشط والتأكد من أن كلا الطرفين يشعران بالاستماع والفهم.",
            "استخدم التعاون في المواقف التي يكون فيها العثور على أفضل حل أكثر أهمية من الحل السريع.",
            "كن صبورًا ومنفتحًا أثناء العمل من خلال عملية تعاونية.",
            "اعترف بأن التعاون يؤدي غالبًا إلى علاقات أقوى وأكثر معنى."
        ],
        "examples": [
            "اعملوا معًا للتخطيط لإجازة عائلية تأخذ في الاعتبار تفضيلات الجميع.",
            "تعاونوا في وضع ميزانية منزلية تتناول احتياجات كلا الشريكين بالكامل.",
            "أنشئ جدولًا زمنيًا مشتركًا يأخذ في الاعتبار التزامات ورغبات كلا الشريكين.",
            "تعاون في تزيين منزلكما من خلال دمج أسلوب كلاكما.",
            "اعمل مع شريكك للعثور على حل لتوازن العمل والحياة يرضي كلاكما."
        ]
    },
    "5": {
        "style": "المنافسة",
        "description": "المنافسة هي أسلوب إدارة الصراع حيث يسعى أحد الأفراد للفوز بالجدال أو تأكيد وجهة نظره، وغالبًا ما يعطي الأولوية لاحتياجاته الخاصة على احتياجات الآخرين.",
        "dos": [
            "استخدم المنافسة عندما تكون هناك حاجة إلى قرارات سريعة ولا يوجد وقت للتعاون.",
            "أكد وجهة نظرك عندما تكون المسألة مهمة بالنسبة لك والتنازل سيتركك غير راضٍ.",
            "تنافس في المواقف التي تحتاج فيها إلى الوقوف على أرضك أو حماية قيمك.",
            "استخدم المنافسة في البيئات المهنية حيث يكون الوضوح في القيادة ضروريًا.",
            "تنافس عندما يكون من الضروري تحقيق نتائج، مثل في المفاوضات أو الصفقات التجارية."
        ],
        "donts": [
            "لا تستخدم المنافسة كأسلوب افتراضي، حيث يمكن أن تؤدي إلى توتر العلاقات.",
            "تجنب المنافسة في القضايا الصغيرة حيث يكون التعاون أو التسوية أكثر فعالية.",
            "لا تنافس إذا كان يعني تجاهل احتياجات الآخرين تمامًا.",
            "تجنب استخدام المنافسة في الأمور العاطفية أو الشخصية، حيث يمكن أن تؤدي إلى استياء.",
            "لا تتنافس إذا كانت العلاقة أكثر أهمية من نتيجة الجدال."
        ],
        "howToCommunicate": [
            "أخبر شريكك لماذا هذه المسألة مهمة للغاية بالنسبة لك ولماذا تقف موقفًا حازمًا.",
            "وضح أنه بينما تقدر مدخلاته، تشعر بقوة حيال الحفاظ على موقفك.",
            "تواصل أن المنافسة ضرورية في هذه الحالة بسبب أهمية المسألة.",
            "اشرح أنك لا تحاول تجاهل وجهة نظره ولكن هذه المسألة غير قابلة للتفاوض بالنسبة لك.",
            "طمئن شريكك أن موقفك التنافسي لا يعني أنك لا تهتم بمشاعره."
        ],
        "commonMisunderstandings": [
            "غالبًا ما يعتقد الناس أن المنافسة دائمًا ضارة، لكنها يمكن أن تكون مفيدة في المواقف المناسبة.",
            "المنافسة يُفهم بشكل خاطئ على أنها أنانية، ولكنها قد تكون عن الدفاع عن القيم المهمة.",
            "يعتقد البعض أن المنافسة تدمر العلاقات دائمًا، لكنها يمكن أن تخلق الاحترام إذا استخدمت بشكل مناسب.",
            "قد يفترض الشركاء أن المنافسة تتعلق بالفوز، لكنها قد تتعلق بضمان نتيجة عادلة.",
            "غالبًا ما يُفترض أن المنافسة تعني تجاهل احتياجات الآخرين تمامًا، وهو ليس الحال دائمًا."
        ],
        "tips": [
            "استخدم المنافسة بحذر وفقط عندما يكون من الضروري أن تؤكد نفسك.",
            "كن واضحًا بشأن سبب اتخاذك موقفًا تنافسيًا لتجنب سوء الفهم.",
            "وازن المنافسة بالتعاطف - اعترف بمشاعر الشخص الآخر حتى لو كنت تختلف.",
            "تعرف على متى تضر المنافسة بالعلاقة وكن مستعدًا للتراجع إذا لزم الأمر.",
            "كن استراتيجيًا في المنافسة - استخدمها لتحقيق أهداف مهمة دون التسبب في صراع غير ضروري."
        ],
        "examples": [
            "قف بحزم في مفاوضة عمل حيث سيؤدي التنازل إلى خسارة.",
            "أكد رأيك في اجتماع الفريق لضمان سماع صوتك في قضية حرجة.",
            "تنافس على ترقية في العمل تشعر أنك المرشح الأفضل لها.",
            "تمسك بقرار عائلي عندما تعتقد أن النتيجة ستفيد الجميع على المدى الطويل.",
            "تولَ قيادة مشروع حيث يجعلك خبرتك الشخص الأنسب لاتخاذ القرارات."
        ]
    }
}