{
    "1": {
        "style": "Toque Físico",
        "description": "El contacto físico implica mostrar amor a través de gestos físicos como abrazos, besos, acurrucarse, e incluso gestos simples como una palmada en la espalda o una mano en el hombro. Es una forma no verbal de mostrar afecto y crear vínculos.",
        "dos": [
            "Toma de la mano en público y en privado.",
            "Da abrazos largos y cálidos regularmente para mostrar afecto.",
            "Ofrece contacto físico reconfortante durante momentos de estrés.",
            "Acurrúcate juntos durante momentos de descanso o antes de dormir.",
            "Da besos espontáneos, masajes en la espalda o toques suaves."
        ],
        "donts": [
            "Evita ser físicamente distante o descuidar el contacto.",
            "No utilices el contacto físico como castigo (por ejemplo, negarte a mostrar afecto).",
            "No asumas que todo contacto físico debe ser sexual.",
            "Evita el contacto físico brusco o descuidado.",
            "No descuides los pequeños momentos de afecto físico, como tomarse de la mano."
        ],
        "howToCommunicate": [
            "Dile a tu pareja que la cercanía física te hace sentir amado y conectado.",
            "Expresa la importancia del contacto no sexual, como acurrucarse y tomarse de la mano.",
            "Hazle saber a tu pareja cuando te sientas desconectado debido a la falta de afecto físico.",
            "Reafírmale que los gestos simples de contacto, como un abrazo o un beso, son muy valiosos para ti.",
            "Explícale que el contacto físico te reconforta en momentos de estrés o ansiedad."
        ],
        "commonMisunderstandings": [
            "Las personas pueden pensar que el contacto físico es puramente sexual, pero se trata de una conexión emocional no verbal.",
            "Algunos pueden pensar que si no son 'cariñosos' por naturaleza, su pareja no lo extrañará.",
            "Puede malinterpretarse que la cantidad de contacto es más importante que la calidad.",
            "Quienes valoran el contacto físico pueden parecer necesitados cuando en realidad solo buscan conexión.",
            "Las parejas pueden creer que el contacto ocasional es suficiente, cuando la consistencia es clave."
        ],
        "tips": [
            "Toca a tu pareja a lo largo del día con pequeños gestos, como un abrazo rápido o una palmada en la espalda.",
            "Inicia contacto físico cariñoso, incluso si tu pareja no siempre lo pide.",
            "Usa el contacto físico para reconectarte después de una discusión o durante situaciones estresantes.",
            "Varía el afecto físico: abrazos, besos, tomarse de la mano y acurrucarse son importantes.",
            "Presta atención al nivel de comodidad de tu pareja y ajusta tus caricias en consecuencia."
        ],
        "examples": [
            "Abraza a tu pareja tan pronto como la veas después de un largo día.",
            "Tómale de la mano mientras caminan o ven la televisión juntos.",
            "Acurrúcate en el sofá mientras ven una película.",
            "Dale un masaje en la espalda para relajarlo/la.",
            "Ofrece un toque reconfortante como una mano en su hombro durante una conversación difícil."
        ]
    },
    "2": {
        "style": "Palabras de Afirmación",
        "description": "Las palabras de afirmación implican expresar amor y aprecio a través de la comunicación verbal o escrita, ofreciendo elogios, aliento y refuerzo positivo para elevar a tu pareja.",
        "dos": [
            "Da cumplidos sinceros sobre su personalidad, apariencia o logros.",
            "Ofrece palabras de aliento cuando persigue sus metas.",
            "Expresa gratitud con frecuencia por sus esfuerzos, tanto grandes como pequeños.",
            "Escribe notas o mensajes reflexivos para mostrar tu aprecio.",
            "Dile a tu pareja regularmente cuánto significa para ti y por qué."
        ],
        "donts": [
            "Evita las críticas duras o el lenguaje negativo que pueda herir profundamente a tu pareja.",
            "No uses sarcasmos o bromas a su costa.",
            "No menosprecies sus emociones ni descartes sus sentimientos.",
            "Evita retener palabras amables cuando tu pareja busca apoyo verbal.",
            "Nunca uses palabras como arma para manipular o controlar."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja que te sientes amado cuando expresa verbalmente su aprecio.",
            "Explica que escuchar palabras positivas y afirmativas eleva tu estado de ánimo y fortalece su vínculo.",
            "Pide que comparta cumplidos o gratitud contigo regularmente, especialmente cuando te sientas desanimado.",
            "Reafírma que incluso los pequeños cumplidos o mensajes pueden marcar una gran diferencia.",
            "Dile que las palabras de aliento te motivan y te hacen sentir valorado."
        ],
        "commonMisunderstandings": [
            "Algunas personas piensan que las palabras de afirmación son superficiales o solo halagos.",
            "Otros pueden suponer que ya sabes que les importas y que no necesitas escucharlo.",
            "Algunas parejas pueden pensar que una vez que dicen 'te amo', no necesitan repetirlo con frecuencia.",
            "Las palabras de afirmación pueden verse como innecesarias si la pareja es más orientada a la acción.",
            "Las personas pueden malentender que las palabras no solo son elogios, sino también apoyo emocional."
        ],
        "tips": [
            "Deja notas de amor sorpresa o mensajes reflexivos en lugares donde tu pareja los encuentre.",
            "Sé específico en tus cumplidos, esto demuestra que realmente estás prestando atención.",
            "Haz un hábito de decir algo positivo cada día, incluso en momentos difíciles.",
            "Usa mensajes de texto para enviar pequeños recordatorios de tu aprecio durante el día.",
            "Escucha atentamente lo que tu pareja dice que valora y reconócelo verbalmente."
        ],
        "examples": [
            "Di 'Aprecio lo duro que trabajas para apoyarnos' después de un largo día de trabajo.",
            "Deja una nota en su bolso o coche que diga: 'Eres increíble, y tengo suerte de tenerte'.",
            "Elogia su atuendo o peinado antes de salir juntos.",
            "Mándale un mensaje durante el día para hacerle saber que estás pensando en él/ella.",
            "Celebra sus logros con palabras alentadoras como '¡Estoy tan orgulloso de ti!'"
        ]
    },
    "3": {
        "style": "Actos de Servicio",
        "description": "Los actos de servicio consisten en demostrar amor realizando acciones útiles para tu pareja, como hacer tareas, realizar recados o asumir responsabilidades para aliviar su carga.",
        "dos": [
            "Ayuda con tareas diarias como cocinar, limpiar o hacer recados sin que te lo pidan.",
            "Ofrécete para asumir responsabilidades que tu pareja encuentra estresantes o que consumen tiempo.",
            "Busca oportunidades para aligerar su carga, como organizar algo o planear con anticipación.",
            "Completa tareas o proyectos que ha mencionado querer hacer pero no ha tenido tiempo.",
            "Sé proactivo: anticipa sus necesidades y actúa antes de que tenga que pedirlo."
        ],
        "donts": [
            "No prometas ayudar y luego no cumplas.",
            "Evita hacer cosas de mala gana o con resentimiento: tu actitud importa.",
            "No supongas que un gran gesto compensa la falta de pequeños actos consistentes.",
            "Refrénate de esperar elogios por cada tarea pequeña: hazlo por amor, no por reconocimiento.",
            "Evita criticar la forma en que tu pareja hace las cosas si se ofrece a ayudar."
        ],
        "howToCommunicate": [
            "Dile a tu pareja que te sientes amado cuando te ayuda con tareas diarias o asume responsabilidades.",
            "Explica que acciones como manejar las tareas o los recados te demuestran que se preocupa por tu bienestar.",
            "Pide que te ayude con tareas específicas, enmarcándolo como una forma de apoyo emocional.",
            "Hazle saber que pequeños actos de servicio, como preparar una comida o hacer un recado, significan mucho para ti.",
            "Reafírma que sus esfuerzos no tienen que ser grandes gestos: las acciones pequeñas y consistentes son lo que más importa."
        ],
        "commonMisunderstandings": [
            "Algunas personas piensan que los actos de servicio son solo hacer tareas, pero se trata de facilitar la vida de tu pareja.",
            "Los socios pueden malentender que ofrecer ayuda sin ser pedido puede mostrar amor.",
            "Puede asumirse que los actos de servicio son solo tareas prácticas, pero el apoyo emocional a través de la acción es clave.",
            "Algunos piensan que si su pareja no pide ayuda, no la necesita, pero anticipar necesidades es importante.",
            "Las personas pueden creer que sus propios esfuerzos no son notados, cuando en realidad son profundamente apreciados."
        ],
        "tips": [
            "Prepara la comida favorita de tu pareja como una sorpresa en un día difícil.",
            "Ofrécete a asumir una tarea o responsabilidad que le pese.",
            "Piensa en lo que puedes hacer para hacerle el día más fácil, como llenar el tanque de gasolina o recoger comestibles.",
            "Haz pequeñas tareas reflexivas regularmente para demostrar que siempre estás pensando en cómo mejorar su vida.",
            "Ofrécete a ayudar con tareas que sabes que no le gustan, como doblar la ropa o sacar la basura."
        ],
        "examples": [
            "Prepara la cena para él/ella cuando sabes que ha tenido un largo día.",
            "Cuida una reparación en el hogar que ha estado en su lista de pendientes.",
            "Lava los platos o haz la colada sin que te lo pidan.",
            "Realiza un recado que ha estado temiendo, como ir a la oficina de correos.",
            "Organiza su espacio de trabajo o una habitación desordenada para darle tranquilidad."
        ]
    },
    "4": {
        "style": "Tiempo de Calidad",
        "description": "El tiempo de calidad implica dedicarle a tu pareja atención plena, compartiendo momentos significativos y experiencias que fortalezcan su conexión.",
        "dos": [
            "Planea citas o actividades regulares que permitan conversaciones significativas.",
            "Aparta distracciones, como tu teléfono, y enfócate completamente en tu pareja.",
            "Participa en actividades que ambos disfruten, como cocinar, caminar o jugar juntos.",
            "Haz preguntas abiertas que fomenten que tu pareja comparta sus pensamientos y sentimientos.",
            "Muestra interés en sus hobbies y encuentra maneras de participar juntos."
        ],
        "donts": [
            "Evita hacer varias cosas a la vez cuando pases tiempo juntos (por ejemplo, revisar tu teléfono).",
            "No descuides el tiempo regular a solas, incluso cuando la vida esté ocupada.",
            "Refrénate de ser pasivo o desinteresado durante las actividades compartidas.",
            "No permitas que las distracciones o interrupciones desvíen tu enfoque de tu pareja.",
            "Evita reprogramar o cancelar planes con frecuencia: puede hacer que tu pareja se sienta poco importante."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja que te sientes más amado cuando te dedica tiempo exclusivamente.",
            "Explica que la atención plena, incluso por un corto tiempo, te hace sentir valorado y apreciado.",
            "Pide momentos regulares en los que ambos puedan desconectarse de las distracciones y enfocarse el uno en el otro.",
            "Comparte con tu pareja que las actividades simples, como hablar o compartir una comida, fortalecen su vínculo.",
            "Reafírma que la calidad del tiempo compartido importa más que la cantidad."
        ],
        "commonMisunderstandings": [
            "La gente a menudo piensa que el tiempo de calidad se trata de la cantidad, pero se trata más de la presencia emocional.",
            "Algunas parejas pueden suponer que pasar tiempo en la misma habitación es suficiente, pero la atención plena es lo que importa.",
            "Se malinterpreta que el tiempo de calidad tiene que incluir citas extravagantes; los momentos simples son igualmente valiosos.",
            "Las parejas pueden pensar que actividades pasivas, como ver televisión juntos, satisfacen la necesidad de tiempo de calidad, pero la participación activa es clave.",
            "Algunos pueden pensar que hablar de tareas diarias cuenta como tiempo de calidad, pero se trata de una conexión más profunda."
        ],
        "tips": [
            "Reserva tiempo cada semana para una cita o actividad sin teléfonos.",
            "Organiza un viaje de un día o una aventura donde ambos puedan experimentar algo nuevo.",
            "Sorprende a tu pareja con una cita o actividad planeada que disfrute.",
            "Participa en sus pasatiempos o intereses, incluso si son diferentes a los tuyos.",
            "Planea una 'escapada en casa' donde pasen tiempo ininterrumpido juntos."
        ],
        "examples": [
            "Sal a caminar juntos y hablen sobre su día o sus sueños.",
            "Tengan una cena sin tecnología donde se enfoquen el uno en el otro.",
            "Planea una escapada de fin de semana para pasar tiempo ininterrumpido juntos.",
            "Jueguen un juego de mesa o trabajen juntos en un rompecabezas.",
            "Cocinen una comida juntos y utilicen la oportunidad para fortalecer su vínculo."
        ]
    },
    "5": {
        "style": "Recibir Regalos",
        "description": "Recibir regalos implica expresar amor a través de presentes pensados que demuestran que has estado pensando en tu pareja. No se trata tanto del valor monetario, sino del sentimiento detrás del gesto.",
        "dos": [
            "Da regalos pensados que demuestren que has considerado los gustos e intereses de tu pareja.",
            "Sorprende a tu pareja con pequeños obsequios significativos que demuestren que piensas en ella.",
            "Celebra ocasiones especiales con presentes simbólicos o personalizados.",
            "Conmemora hitos, aniversarios y fechas importantes con regalos.",
            "Ofrece regalos espontáneos 'solo porque sí' para mostrar que la aprecias."
        ],
        "donts": [
            "No des regalos sin sentido o genéricos sin valor sentimental.",
            "Evita olvidar fechas importantes o hitos que sean importantes para tu pareja.",
            "Refrénate de pensar que los regalos costosos son siempre mejores; lo que cuenta es la intención.",
            "No supongas que los regalos tienen que ser materialistas; pueden ser simbólicos o sentimentales.",
            "Evita dar regalos solo cuando se espera; los gestos espontáneos pueden ser más significativos."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja que recibir regalos te hace sentir amado porque muestra pensamiento y esfuerzo.",
            "Explica que no se trata del precio del regalo, sino del significado detrás de él.",
            "Comparte que recibir regalos, incluso pequeños, te hace sentir apreciado y valorado.",
            "Pide que preste atención a tus intereses y te sorprenda con presentes pensados ocasionalmente.",
            "Reafírma que los regalos sentimentales y significativos, como una nota escrita a mano, son los que más te importan."
        ],
        "commonMisunderstandings": [
            "Algunas personas piensan que aquellos que valoran los regalos son materialistas, pero se trata más del pensamiento y esfuerzo detrás del regalo.",
            "Se malinterpreta que los regalos deben ser costosos, cuando en realidad se trata del significado emocional.",
            "Algunos pueden suponer que los regalos son solo para ocasiones especiales, pero los gestos espontáneos son igualmente importantes.",
            "Las parejas pueden creer que si ya dieron un gran regalo, no necesitan hacer más, pero los pequeños obsequios regulares son valiosos.",
            "Algunos pueden pensar que los regalos son puramente materiales, pero pueden simbolizar amor, cuidado y consideración."
        ],
        "tips": [
            "Presta atención a las cosas que tu pareja menciona que quiere o necesita y sorpréndela con eso más tarde.",
            "Mantén una lista de cosas que hacen feliz a tu pareja y úsala para elegir regalos.",
            "Considera dar regalos que se relacionen con recuerdos compartidos, como un álbum de fotos o un recuerdo.",
            "Personaliza los regalos para reflejar los intereses o preferencias únicos de tu pareja.",
            "Sorprende a tu pareja con pequeños regalos pensados, como su golosina favorita o un libro que ha querido."
        ],
        "examples": [
            "Regala un libro de su autor favorito, demostrando que recuerdas sus intereses.",
            "Sorprende a tu pareja con su bocadillo favorito o flores después de un largo día.",
            "Celebra un aniversario regalando algo significativo de tu relación, como una foto enmarcada.",
            "Compra boletos para un evento que le entusiasma, como un concierto o un espectáculo.",
            "Da un regalo personalizado, como una joya personalizada o un recuerdo grabado."
        ]
    }
}