{
    "1": {
        "style": "Toque Físico",
        "description": "O toque físico envolve demonstrar amor por meio de gestos físicos, como abraços, beijos, aconchegos, e até gestos simples, como um tapinha nas costas ou uma mão no ombro. É uma maneira não verbal de mostrar afeto e criar laços.",
        "dos": [
            "Segure as mãos em público e em ambientes privados.",
            "Dê abraços longos e calorosos regularmente para mostrar afeto.",
            "Ofereça contato físico reconfortante durante momentos de estresse.",
            "Aconchegue-se durante os momentos de descanso ou antes de dormir.",
            "Dê beijos espontâneos, massagens nas costas ou toques suaves."
        ],
        "donts": [
            "Evite ser fisicamente distante ou negligenciar o contato.",
            "Não use o toque físico como punição (por exemplo, evitar mostrar afeto).",
            "Não presuma que todo contato físico deve ser sexual.",
            "Evite contato físico brusco ou descuidado.",
            "Não negligencie os pequenos momentos de afeto físico, como segurar as mãos."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que a proximidade física faz você se sentir amado e conectado.",
            "Expresse a importância do toque não sexual, como aconchegar-se e segurar as mãos.",
            "Diga ao seu parceiro quando você se sentir desconectado devido à falta de afeto físico.",
            "Reafirme que gestos simples de toque, como um abraço ou beijo, são valiosos para você.",
            "Explique que o toque físico o/a conforta em momentos de estresse ou ansiedade."
        ],
        "commonMisunderstandings": [
            "As pessoas podem pensar que o toque físico é puramente sexual, mas é sobre conexão emocional não verbal.",
            "Alguns podem pensar que, se não forem 'carinhosos', seu parceiro não sentirá falta.",
            "Pode-se interpretar mal que a quantidade de toque é mais importante do que a qualidade.",
            "Aqueles que valorizam o toque físico podem parecer necessitados quando estão apenas buscando conexão.",
            "Parceiros podem acreditar que o toque ocasional é suficiente, quando a consistência é a chave."
        ],
        "tips": [
            "Toque seu parceiro ao longo do dia com pequenos gestos, como um abraço rápido ou um tapinha nas costas.",
            "Inicie contato físico afetuoso, mesmo que seu parceiro não peça.",
            "Use o toque físico para se reconectar após uma discussão ou em situações estressantes.",
            "Mantenha a afeição física variada—abraços, beijos, segurar as mãos e aconchegar-se são importantes.",
            "Preste atenção ao nível de conforto do seu parceiro e ajuste seus toques conforme necessário."
        ],
        "examples": [
            "Abrace seu parceiro assim que o vir após um longo dia.",
            "Segure as mãos enquanto caminham ou assistem TV juntos.",
            "Aconchegue-se no sofá enquanto assistem a um filme.",
            "Dê uma massagem nas costas ou nos ombros para relaxar seu parceiro.",
            "Ofereça um toque reconfortante, como uma mão no ombro durante uma conversa difícil."
        ]
    },
    "2": {
        "style": "Palavras de Afirmação",
        "description": "Palavras de afirmação envolvem expressar amor e apreço por meio de comunicação verbal ou escrita, oferecendo elogios, encorajamento e reforço positivo para elevar seu parceiro.",
        "dos": [
            "Dê elogios sinceros sobre sua personalidade, aparência ou realizações.",
            "Ofereça palavras de encorajamento quando ele/ela estiver perseguindo suas metas.",
            "Expresse gratidão com frequência por seus esforços, tanto grandes quanto pequenos.",
            "Escreva notas ou mensagens atenciosas para mostrar seu apreço.",
            "Diga regularmente ao seu parceiro quanto ele/ela significa para você e por quê."
        ],
        "donts": [
            "Evite críticas duras ou linguagem negativa que possam ferir profundamente seu parceiro.",
            "Não use sarcasmo ou piadas às custas dele/dela.",
            "Não menospreze as emoções ou descarte os sentimentos do seu parceiro.",
            "Evite reter palavras gentis quando seu parceiro estiver buscando confirmação verbal.",
            "Nunca use palavras como arma para manipular ou controlar."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que você se sente amado quando ele/ela expressa verbalmente seu apreço.",
            "Explique que ouvir palavras positivas e afirmativas eleva seu humor e fortalece seu vínculo.",
            "Peça para compartilhar elogios ou gratidão com você regularmente, especialmente quando você estiver se sentindo para baixo.",
            "Reafirme que mesmo pequenos elogios ou mensagens podem fazer uma grande diferença.",
            "Diga que palavras de encorajamento o/a motivam e fazem você se sentir valorizado."
        ],
        "commonMisunderstandings": [
            "Algumas pessoas acham que palavras de afirmação são superficiais ou apenas lisonja.",
            "Outros podem presumir que você já sabe que eles se importam e que não precisa ouvir isso.",
            "Alguns parceiros podem pensar que, uma vez que dizem 'eu te amo', não precisam repetir com frequência.",
            "Palavras de afirmação podem ser vistas como desnecessárias se o parceiro for mais orientado à ação.",
            "As pessoas podem entender mal que as palavras não são apenas elogios, mas também incluem apoio emocional."
        ],
        "tips": [
            "Deixe notas de amor surpresa ou mensagens atenciosas em lugares onde seu parceiro as encontrará.",
            "Seja específico em seus elogios—isso mostra que você realmente está prestando atenção.",
            "Crie o hábito de dizer algo positivo todos os dias, mesmo durante momentos difíceis.",
            "Use mensagens de texto para enviar pequenos lembretes de seu apreço ao longo do dia.",
            "Ouça atentamente o que seu parceiro valoriza e reconheça isso verbalmente."
        ],
        "examples": [
            "Diga 'Agradeço o quanto você trabalha para nos apoiar' após um longo dia de trabalho.",
            "Deixe uma nota no bolso ou no carro dele/dela dizendo: 'Você é incrível, e tenho sorte de ter você.'",
            "Elogie sua roupa ou cabelo antes de saírem juntos.",
            "Envie uma mensagem durante o dia para dizer que você está pensando nele/nela.",
            "Celebre suas conquistas com palavras de encorajamento, como 'Estou tão orgulhoso(a) de você!'"
        ]
    },
    "3": {
        "style": "Atos de Serviço",
        "description": "Atos de serviço envolvem demonstrar amor realizando ações úteis para seu parceiro, como fazer tarefas, realizar recados ou assumir responsabilidades para aliviar sua carga.",
        "dos": [
            "Ajude com tarefas diárias, como cozinhar, limpar ou fazer compras sem que seja pedido.",
            "Ofereça-se para assumir responsabilidades que seu parceiro acha estressantes ou que consomem tempo.",
            "Procure oportunidades para aliviar a carga dele/dela, como organizar algo ou planejar com antecedência.",
            "Conclua tarefas ou projetos que ele/ela mencionou querer fazer, mas ainda não teve tempo.",
            "Seja proativo—antecipe as necessidades dele/dela e aja antes que precise pedir."
        ],
        "donts": [
            "Não faça promessas de ajudar e depois não cumpra.",
            "Evite fazer as coisas de má vontade ou com ressentimento—sua atitude importa.",
            "Não presuma que um grande gesto compensará a falta de pequenos atos consistentes.",
            "Refrénte-se de esperar elogios para cada pequena tarefa—faça por amor, não por reconhecimento.",
            "Evite criticar a maneira como seu parceiro faz as coisas se ele/ela se oferecer para ajudar."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que você se sente amado quando ele/ela ajuda nas tarefas diárias ou assume responsabilidades.",
            "Explique que ações como lidar com tarefas ou recados mostram que ele/ela se importa com seu bem-estar.",
            "Peça ajuda com tarefas específicas, dizendo que é uma forma de apoio emocional.",
            "Deixe claro que pequenos atos de serviço, como preparar uma refeição ou fazer um recado, significam muito para você.",
            "Reafirme que os esforços dele/dela não precisam ser grandes gestos—ações pequenas e consistentes são as que mais importam."
        ],
        "commonMisunderstandings": [
            "Algumas pessoas acham que atos de serviço são apenas sobre fazer tarefas, mas trata-se de facilitar a vida do parceiro.",
            "Parceiros podem entender mal que oferecer ajuda sem ser solicitado pode mostrar amor.",
            "Pode-se assumir que atos de serviço são apenas tarefas práticas, mas o apoio emocional através da ação é fundamental.",
            "Alguns acham que, se o parceiro não pede ajuda, ele/ela não precisa, mas antecipar necessidades é importante.",
            "As pessoas podem acreditar que seus próprios esforços não são notados, quando na verdade são profundamente apreciados."
        ],
        "tips": [
            "Prepare a refeição favorita de seu parceiro como uma surpresa em um dia difícil.",
            "Ofereça-se para assumir uma tarefa ou responsabilidade que pesa sobre ele/ela.",
            "Pense à frente sobre o que você pode fazer para tornar o dia dele/dela mais fácil, como abastecer o carro ou fazer compras.",
            "Realize pequenas tarefas reflexivas regularmente para demonstrar que sempre está pensando em como melhorar sua vida.",
            "Ofereça-se para ajudar com tarefas que você sabe que ele/ela não gosta, como dobrar as roupas ou tirar o lixo."
        ],
        "examples": [
            "Prepare o jantar para ele/ela quando souber que teve um dia longo.",
            "Cuide de um reparo em casa que estava na lista de afazeres.",
            "Lave a louça ou faça a lavanderia sem que seja pedido.",
            "Realize uma tarefa que ele/ela estava adiando, como ir aos correios.",
            "Organize o espaço de trabalho ou um quarto bagunçado para dar tranquilidade."
        ]
    },
    "4": {
        "style": "Tempo de Qualidade",
        "description": "O tempo de qualidade envolve dar ao seu parceiro atenção total, passando momentos significativos juntos e compartilhando experiências que fortalecem a conexão.",
        "dos": [
            "Planeje encontros ou atividades regulares que permitam conversas significativas.",
            "Desligue distrações, como o telefone, e concentre-se totalmente em seu parceiro.",
            "Engaje-se em atividades que ambos gostem, como cozinhar, caminhar ou jogar juntos.",
            "Faça perguntas abertas que incentivem seu parceiro a compartilhar seus pensamentos e sentimentos.",
            "Mostre interesse nos hobbies dele/dela e encontre maneiras de participar juntos."
        ],
        "donts": [
            "Evite realizar várias tarefas ao mesmo tempo enquanto passa tempo juntos (por exemplo, verificar o telefone).",
            "Não negligencie o tempo regular a dois, mesmo quando a vida estiver corrida.",
            "Refrénte-se de ser passivo ou desinteressado durante atividades compartilhadas.",
            "Não permita que distrações ou interrupções tirem seu foco de seu parceiro.",
            "Evite remarcar ou cancelar planos frequentemente—isso pode fazer seu parceiro se sentir sem importância."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que você se sente mais amado quando ele/ela dedica tempo exclusivamente a você.",
            "Explique que a atenção plena, mesmo por um curto período, faz você se sentir valorizado e apreciado.",
            "Peça momentos regulares em que ambos possam se desconectar das distrações e se concentrar um no outro.",
            "Compartilhe que atividades simples, como conversar ou compartilhar uma refeição, fortalecem seu vínculo.",
            "Reafirme que a qualidade do tempo passado juntos importa mais que a quantidade."
        ],
        "commonMisunderstandings": [
            "Muitas vezes as pessoas pensam que o tempo de qualidade está relacionado à quantidade, mas trata-se mais de presença emocional.",
            "Alguns parceiros podem presumir que passar tempo na mesma sala é suficiente, mas o foco é o que importa.",
            "É mal compreendido que o tempo de qualidade precise envolver encontros extravagantes—momentos simples são igualmente valiosos.",
            "Parceiros podem pensar que atividades passivas, como assistir TV juntos, atendem à necessidade de tempo de qualidade, mas a participação ativa é fundamental.",
            "Alguns podem pensar que falar sobre tarefas diárias conta como tempo de qualidade, mas trata-se de conexão mais profunda."
        ],
        "tips": [
            "Separe tempo toda semana para uma atividade ou encontro sem telefones.",
            "Planeje uma viagem de um dia ou aventura onde ambos possam experimentar algo novo.",
            "Surpreenda seu parceiro com um encontro ou atividade planejada que ele/ela goste.",
            "Participe dos hobbies ou interesses dele/dela, mesmo que sejam diferentes dos seus.",
            "Planeje uma 'escapada em casa' onde passem tempo ininterrupto juntos."
        ],
        "examples": [
            "Caminhe junto e fale sobre o dia ou sobre seus sonhos.",
            "Tenham um jantar sem tecnologia, focando-se um no outro.",
            "Planeje uma escapada de fim de semana para passarem tempo ininterrupto juntos.",
            "Joguem um jogo de tabuleiro ou trabalhem juntos em um quebra-cabeça.",
            "Cozinhem uma refeição juntos e usem isso como uma oportunidade para se conectarem."
        ]
    },
    "5": {
        "style": "Receber Presentes",
        "description": "Receber presentes envolve expressar amor por meio de presentes pensativos que demonstram que você está pensando em seu parceiro. Não se trata tanto do valor monetário, mas do sentimento por trás do gesto.",
        "dos": [
            "Dê presentes pensados que mostrem que você considerou as preferências e interesses do seu parceiro.",
            "Surpreenda seu parceiro com pequenos presentes significativos que mostrem que você está pensando nele/nela.",
            "Comemore ocasiões especiais com presentes simbólicos ou personalizados.",
            "Comemore marcos, aniversários e datas importantes com presentes.",
            "Ofereça presentes espontâneos 'só porque' para mostrar que você o/a aprecia."
        ],
        "donts": [
            "Não dê presentes sem consideração ou genéricos sem valor sentimental.",
            "Evite esquecer datas importantes ou marcos que sejam importantes para seu parceiro.",
            "Refrénte-se de pensar que presentes caros são sempre melhores—o que importa é o pensamento por trás.",
            "Não presuma que os presentes têm que ser materialistas; podem ser simbólicos ou sentimentais.",
            "Evite dar presentes apenas quando esperado—gestos espontâneos podem ser mais significativos."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que receber presentes faz você se sentir amado porque mostra consideração e esforço.",
            "Explique que não se trata do preço do presente, mas da consideração por trás dele.",
            "Compartilhe que receber presentes, mesmo pequenos, faz você se sentir apreciado e valorizado.",
            "Peça que ele/ela preste atenção nos seus interesses e surpreenda você com presentes pensados de vez em quando.",
            "Reafirme que presentes sentimentais e significativos, como um bilhete escrito à mão, são os que mais importam para você."
        ],
        "commonMisunderstandings": [
            "Algumas pessoas pensam que aqueles que valorizam presentes são materialistas, mas trata-se mais do pensamento e esforço por trás do presente.",
            "Há uma má compreensão de que presentes precisam ser caros, quando na verdade se trata do significado emocional.",
            "As pessoas podem assumir que os presentes são apenas para ocasiões especiais, mas gestos espontâneos são igualmente importantes.",
            "Parceiros podem acreditar que, se já deram um grande presente, não precisam fazer mais, mas pequenos presentes regulares são valiosos.",
            "Alguns podem pensar que presentes são puramente materiais, mas podem simbolizar amor, cuidado e consideração."
        ],
        "tips": [
            "Preste atenção nas coisas que seu parceiro menciona querer ou precisar e surpreenda-o/a mais tarde.",
            "Mantenha uma lista de coisas que fazem seu parceiro feliz e use-a para escolher presentes.",
            "Considere dar presentes que se relacionem com memórias compartilhadas, como um álbum de fotos ou um presente sentimental.",
            "Personalize os presentes para refletir os interesses ou preferências únicos do seu parceiro.",
            "Surpreenda seu parceiro com pequenos presentes atenciosos, como seu lanche favorito ou um livro que ele/ela quer."
        ],
        "examples": [
            "Dê um livro de seu autor favorito, mostrando que você se lembra dos interesses dele/dela.",
            "Surpreenda seu parceiro com seu lanche favorito ou flores depois de um longo dia.",
            "Comemore um aniversário presenteando algo significativo do seu relacionamento, como uma foto emoldurada.",
            "Compre ingressos para um evento que ele/ela está empolgado para ver, como um show ou espetáculo.",
            "Dê um presente personalizado, como uma peça de joia customizada ou um presente gravado."
        ]
    }
}