{
    "1": {
        "style": "اللمس الجسدي",
        "description": "اللمس الجسدي يتضمن إظهار الحب من خلال العاطفة الجسدية مثل العناق، القبلات، الاحتضان، وحتى الإيماءات البسيطة مثل الربت على الظهر أو وضع اليد على الكتف. إنه طريقة غير لفظية لإظهار الحب وتعزيز العلاقة.",
        "dos": [
            "امسك يد شريكك في الأماكن العامة والخاصة.",
            "أعطه عناقًا طويلًا ودافئًا بانتظام لتظهر حبك.",
            "قدم لمسات جسدية مريحة في أوقات التوتر.",
            "احتضن معًا خلال أوقات الراحة أو قبل النوم.",
            "قدم قبلات عفوية، تدليك للظهر، أو لمسات لطيفة."
        ],
        "donts": [
            "تجنب أن تكون بعيدًا جسديًا أو تتجاهل اللمس.",
            "لا تستخدم اللمس الجسدي كعقوبة (مثل تجنب إظهار العاطفة).",
            "لا تفترض أن كل لمسة جسدية يجب أن تكون جنسية.",
            "تجنب اللمس القاسي أو غير الحذر.",
            "لا تهمل اللحظات الصغيرة من العاطفة الجسدية، مثل الإمساك باليد."
        ],
        "howToCommunicate": [
            "أخبر شريكك أن القرب الجسدي يجعلك تشعر بالحب والاتصال.",
            "عبر عن أهمية اللمس غير الجنسي، مثل الاحتضان والإمساك باليد.",
            "أخبر شريكك عندما تشعر بالانفصال بسبب نقص العاطفة الجسدية.",
            "طمئنه أن الإيماءات البسيطة من اللمس، مثل العناق أو القبلة، تعني الكثير لك.",
            "اشرح له أن اللمس الجسدي يريحك في أوقات التوتر أو القلق."
        ],
        "commonMisunderstandings": [
            "قد يعتقد الناس أن اللمس الجسدي يتعلق فقط بالجنس، لكنه يتعلق بالاتصال العاطفي غير اللفظي.",
            "بعض الناس يعتقدون أنه إذا لم يكونوا 'حنونين' بطبيعتهم، فلن يفتقدهم شريكهم.",
            "قد يُفهم بشكل خاطئ أن كمية اللمس أكثر أهمية من الجودة.",
            "الذين يقدرون اللمس الجسدي قد يظهرون كما لو أنهم بحاجة، بينما هم فقط يسعون للاتصال.",
            "قد يعتقد الشركاء أن اللمس العرضي كافٍ، بينما الاستمرارية هي المفتاح."
        ],
        "tips": [
            "المس شريكك على مدار اليوم بإيماءات صغيرة، مثل عناق سريع أو ربتة على الظهر.",
            "ابدأ الاتصال الجسدي العاطفي، حتى لو لم يطلب شريكك.",
            "استخدم اللمس الجسدي لإعادة الاتصال بعد جدال أو في الأوقات العصيبة.",
            "حافظ على التنوع في العاطفة الجسدية—العناق، القبلات، الإمساك باليد، والاحتضان كلها مهمة.",
            "انتبه لمستوى راحة شريكك وقم بتعديل لمساتك وفقًا لذلك."
        ],
        "examples": [
            "عانق شريكك فور رؤيته بعد يوم طويل.",
            "امسك يديه أثناء المشي أو مشاهدة التلفاز معًا.",
            "احتضنا على الأريكة أثناء مشاهدة فيلم.",
            "قم بتدليك ظهره أو كتفيه لتريحه.",
            "قدم لمسة مريحة مثل وضع يدك على كتفه أثناء محادثة صعبة."
        ]
    },
    "2": {
        "style": "كلمات التأكيد",
        "description": "كلمات التأكيد تتضمن التعبير عن الحب والتقدير من خلال التواصل اللفظي أو المكتوب، وتقديم التشجيع والمجاملات والتعزيز الإيجابي لرفع شريكك.",
        "dos": [
            "قدم مجاملات صادقة حول شخصيته أو مظهره أو إنجازاته.",
            "قدم كلمات تشجيعية عندما يسعى لتحقيق أهدافه.",
            "عبر عن الامتنان بانتظام لجهوده الكبيرة والصغيرة.",
            "اكتب ملاحظات أو رسائل مدروسة لتظهر تقديرك.",
            "قل لشريكك بانتظام كم يعني لك ولماذا."
        ],
        "donts": [
            "تجنب الانتقادات القاسية أو اللغة السلبية التي يمكن أن تؤذي شريكك بعمق.",
            "لا تستخدم السخرية أو النكات على حسابه.",
            "لا تقلل من مشاعره أو ترفض مشاعره.",
            "تجنب حجب الكلمات اللطيفة عندما يحتاج شريكك إلى التأكيد اللفظي.",
            "لا تستخدم الكلمات كسلاح للتحكم أو التلاعب."
        ],
        "howToCommunicate": [
            "أخبر شريكك أنك تشعر بالحب عندما يعبر عن تقديره اللفظي.",
            "اشرح له أن سماع الكلمات الإيجابية والملهمة يرفع من معنوياتك ويقوي علاقتكما.",
            "اطلب منه مشاركة المجاملات أو الامتنان بانتظام، خاصة عندما تشعر بالإحباط.",
            "طمئنه أن المجاملات الصغيرة أو الرسائل يمكن أن تحدث فرقًا كبيرًا.",
            "أخبره أن كلمات التشجيع تساعد في تحفيزك وتشعرك بالقيمة."
        ],
        "commonMisunderstandings": [
            "يعتقد بعض الناس أن كلمات التأكيد سطحية أو مجرد مجاملات فارغة.",
            "الآخرون قد يفترضون أنك تعرف بالفعل أنهم يهتمون ولا تحتاج إلى سماع ذلك.",
            "بعض الشركاء يعتقدون أنه بمجرد قول 'أنا أحبك'، لا يحتاجون إلى قولها كثيرًا.",
            "كلمات التأكيد قد تُرى على أنها غير ضرورية إذا كان الشريك يميل إلى الأفعال أكثر من الكلمات.",
            "الناس قد يسيئون فهم أن الكلمات ليست مجرد مجاملات، بل تشمل أيضًا الدعم العاطفي."
        ],
        "tips": [
            "اترك ملاحظات حب مفاجئة أو رسائل مدروسة في أماكن سيجدها شريكك.",
            "كن محددًا في مجاملاتك—هذا يظهر أنك حقًا تولي اهتمامًا.",
            "اجعل من العادة أن تقول شيئًا إيجابيًا كل يوم، حتى في الأوقات الصعبة.",
            "استخدم الرسائل النصية لإرسال تذكيرات صغيرة بتقديرك على مدار اليوم.",
            "استمع جيدًا لما يقدره شريكك واعتبره في كلماتك."
        ],
        "examples": [
            "قل 'أقدر كيف تعمل بجد لدعمنا' بعد يوم عمل طويل.",
            "اترك ملاحظة في حقيبته أو سيارته تقول: 'أنت رائع، وأنا محظوظ لوجودك.'",
            "قدمه مجاملة حول مظهره أو شعره قبل الخروج معًا.",
            "أرسل له رسالة خلال اليوم لتخبره أنك تفكر فيه.",
            "احتفل بإنجازاته بكلمات تشجيعية مثل 'أنا فخور جدًا بك!'"
        ]
    },
    "3": {
        "style": "أفعال الخدمة",
        "description": "أفعال الخدمة تتضمن إظهار الحب عن طريق القيام بأعمال مفيدة لشريكك، مثل إنجاز المهام، القيام بالمهمات، أو تحمل المسؤوليات لتخفيف عبء شريكك.",
        "dos": [
            "ساعد في الأعمال اليومية مثل الطهي أو التنظيف أو القيام بالمهمات دون أن يُطلب منك.",
            "اعرض تولي المهام التي يجدها شريكك مرهقة أو تستغرق وقتًا طويلًا.",
            "ابحث عن الفرص لتخفيف عبئه، مثل تنظيم شيء أو التخطيط مسبقًا.",
            "أنجز المهام أو المشاريع التي ذكرها شريكك ولكنه لم يجد الوقت لها.",
            "كن استباقيًا—توقع احتياجاته واتخذ إجراء قبل أن يحتاج لطلب ذلك."
        ],
        "donts": [
            "لا تعد بتقديم المساعدة ثم تفشل في الوفاء بوعدك.",
            "تجنب القيام بالأشياء على مضض أو بغضب—موقفك مهم.",
            "لا تفترض أن لفتة كبيرة واحدة تعوض عن عدم القيام بأعمال صغيرة باستمرار.",
            "تجنب توقع الثناء على كل مهمة صغيرة—قم بها بدافع الحب، وليس للاعتراف.",
            "لا تنتقد الطريقة التي يقوم بها شريكك بالأشياء إذا عرض المساعدة."
        ],
        "howToCommunicate": [
            "أخبر شريكك أنك تشعر بالحب عندما يساعدك في المهام اليومية أو يتحمل المسؤوليات.",
            "اشرح أن الأفعال مثل إنجاز المهام أو المهمات تُظهر لك أنه يهتم برفاهيتك.",
            "اطلب منه المشاركة في مهام محددة كوسيلة لدعمك عاطفيًا.",
            "أخبره أن الأعمال الصغيرة مثل إعداد وجبة أو القيام بمهمة لها تأثير كبير عليك.",
            "طمئنه أن جهوده لا تحتاج إلى أن تكون لفتات كبيرة—الأعمال الصغيرة والمتسقة هي الأهم."
        ],
        "commonMisunderstandings": [
            "يعتقد بعض الناس أن أفعال الخدمة تتعلق فقط بالأعمال، لكنها تتعلق بتسهيل حياة شريكك.",
            "الشركاء قد يساء فهمهم بأن تقديم المساعدة دون أن يُطلب منهم يمكن أن يُظهر الحب.",
            "قد يُفهم خطأً أن أفعال الخدمة تتعلق فقط بالمهام العملية، ولكن الدعم العاطفي من خلال الأفعال هو الأساس.",
            "البعض يعتقد أن إذا لم يطلب شريكهم المساعدة، فهو لا يحتاجها، ولكن توقع الاحتياجات أمر مهم.",
            "قد يعتقد الناس أن جهودهم غير ملاحظة، في حين أنها مقدرة بعمق."
        ],
        "tips": [
            "قم بتحضير وجبة شريكك المفضلة كنوع من المفاجأة في يوم صعب.",
            "اعرض تحمل مهمة أو مسؤولية تشكل عبئًا عليه.",
            "فكر مسبقًا في الأشياء التي يمكنك فعلها لتسهيل يومه، مثل ملء السيارة بالوقود أو شراء البقالة.",
            "قم بأعمال صغيرة بانتظام لتظهر أنك تفكر دائمًا في كيفية تحسين حياته.",
            "اعرض المساعدة في المهام التي تعرف أنه لا يحبها، مثل طي الملابس أو إخراج القمامة."
        ],
        "examples": [
            "أعد العشاء له عندما تعلم أنه مر بيوم طويل.",
            "قم بإصلاح شيء في المنزل كان على قائمة مهامه لفترة.",
            "اغسل الأطباق أو قم بالغسيل دون أن يُطلب منك.",
            "قم بإنجاز مهمة كان يتجنبها، مثل الذهاب إلى مكتب البريد.",
            "نظم مساحة عمله أو غرفة فوضوية لتمنحه راحة البال."
        ]
    },
    "4": {
        "style": "وقت ممتع",
        "description": "الوقت الجيد يتضمن منح شريكك اهتمامًا كاملاً، قضاء لحظات مهمة معًا، ومشاركة تجارب تعزز الاتصال بينكما.",
        "dos": [
            "خطط لمواعيد أو أنشطة منتظمة تسمح بالمحادثات العميقة.",
            "أغلق المشتتات، مثل الهاتف، وركز تمامًا على شريكك.",
            "اشترك في أنشطة تستمتعان بها معًا، مثل الطهي، المشي، أو اللعب معًا.",
            "اطرح أسئلة مفتوحة تشجع شريكك على مشاركة أفكاره ومشاعره.",
            "اظهر الاهتمام بهواياته وابحث عن طرق للمشاركة معًا."
        ],
        "donts": [
            "تجنب القيام بأشياء متعددة في نفس الوقت أثناء قضاء الوقت معًا (مثل التحقق من الهاتف).",
            "لا تهمل الوقت المنتظم الذي تقضونه معًا، حتى عندما تكون الحياة مشغولة.",
            "تجنب أن تكون سلبيًا أو غير مهتم خلال الأنشطة المشتركة.",
            "لا تدع المشتتات أو المقاطعات تسحب تركيزك بعيدًا عن شريكك.",
            "تجنب إعادة جدولة أو إلغاء الخطط في كثير من الأحيان—قد يجعل شريكك يشعر بأنه غير مهم."
        ],
        "howToCommunicate": [
            "أخبر شريكك أنك تشعر بأنك محبوب عندما يخصص وقتًا لك فقط.",
            "اشرح أن الانتباه غير المنقطع، حتى لو كان لفترة قصيرة، يجعلك تشعر بالتقدير.",
            "اطلب لحظات منتظمة يمكنكما فيها قطع الاتصال بالمشتتات والتركيز على بعضكما البعض.",
            "أخبره أن الأنشطة البسيطة، مثل الحديث أو مشاركة وجبة، تقوي العلاقة.",
            "طمئنه أن نوعية الوقت الذي تقضونه معًا أكثر أهمية من الكمية."
        ],
        "commonMisunderstandings": [
            "غالبًا ما يعتقد الناس أن الوقت الجيد يتعلق بالكمية، لكنه يتعلق أكثر بالحضور العاطفي.",
            "قد يفترض بعض الشركاء أن قضاء الوقت في نفس الغرفة يكفي، لكن التركيز هو الأهم.",
            "يُفهم خطأً أن الوقت الجيد يجب أن يتضمن مواعيد فخمة—اللحظات البسيطة قيمة بنفس القدر.",
            "قد يعتقد الشركاء أن الأنشطة السلبية، مثل مشاهدة التلفاز معًا، تلبي الحاجة إلى الوقت الجيد، ولكن المشاركة الفعالة هي الأساس.",
            "قد يعتقد البعض أن الحديث عن المهام اليومية يُعد وقتًا جيدًا، لكنه يتعلق بالاتصال الأعمق."
        ],
        "tips": [
            "خصص وقتًا كل أسبوع لنشاط أو موعد بدون استخدام الهواتف.",
            "خطط لرحلة ليوم أو مغامرة حيث يمكنكما تجربة شيء جديد معًا.",
            "فاجئ شريكك بموعد أو نشاط مخطط يحبه.",
            "اشترك في هواياته أو اهتماماته، حتى لو كانت مختلفة عن اهتماماتك.",
            "خطط 'لقضاء إجازة في المنزل' حيث تقضيان وقتًا غير متقطع معًا في المنزل."
        ],
        "examples": [
            "اذهبا في نزهة طويلة معًا وتحدثا عن يومكما أو أحلامكما.",
            "تناولا عشاءًا خاليًا من التكنولوجيا وركزا على بعضكما البعض.",
            "خططا لقضاء عطلة نهاية الأسبوع معًا لقضاء وقت غير متقطع.",
            "العبا لعبة لوحية أو اعملا على لغز معًا.",
            "اطهيا وجبة معًا واستخدماها كفرصة لتعزيز العلاقة."
        ]
    },
        "5": {
          "style": "تلقي الهدايا",
          "description": "تلقى الهدايا يعني التعبير عن الحب من خلال تقديم هدايا مدروسة تظهر لشريكك أنك تفكر فيه. لا يتعلق الأمر بالقيمة المادية بقدر ما يتعلق بالقيمة العاطفية وراء الهدية.",
          "dos": [
            "قدم هدايا مدروسة تظهر أنك أخذت في الاعتبار تفضيلات واهتمامات شريكك.",
            "افاجئ شريكك بهدايا صغيرة ذات معنى تظهر أنك تفكر فيه.",
            "احتفل بالمناسبات الخاصة بهدايا رمزية أو مخصصة.",
            "احتفل بالمعالم الكبيرة، كالأعياد والذكريات المهمة مع الهدايا.",
            "قدم هدايا عفوية 'فقط لأن' لإظهار أنك تقدر شريكك."
        ],
          "donts": [
            "لا تقدم هدايا غير مدروسة أو عامة دون أي قيمة عاطفية.",
            "تجنب نسيان التواريخ المهمة أو المعالم التي تهم شريكك.",
            "لا تفترض أن الهدايا الغالية دائمًا هي الأفضل - الأهم هو التفكير.",
            "لا تعتقد أن الهدايا يجب أن تكون مادية فقط؛ يمكن أن تكون رمزية أو عاطفية.",
            "تجنب تقديم الهدايا فقط عند المتوقع - الإيماءات العفوية قد تكون أكثر مغزى."
        ],
          "howToCommunicate": [
            "أخبر شريكك أن تلقي الهدايا يجعلك تشعر بأنك محبوب لأنه يظهر التفكير والجهد.",
            "اشرح أن الأمر لا يتعلق بسعر الهدية، بل بالقيمة العاطفية وراءها.",
            "شاركهم بأن تلقي الهدايا، حتى الصغيرة منها، يجعلك تشعر بالتقدير والقيمة.",
            "اطلب منهم الانتباه إلى اهتماماتك وفاجئك بهدايا مدروسة من وقت لآخر.",
            "طمئنهم بأن الهدايا العاطفية والمعنوية، مثل الوجبات المفضلة أو الرسائل المكتوبة بخط اليد، هي ما يعني لك أكثر."
        ],
          "commonMisunderstandings": [
            "يعتقد البعض أن الأشخاص الذين يقدرون الهدايا هم ماديون، لكن الحقيقة هي أن الأمر يتعلق بالتفكير والجهد وراء الهدية.",
            "يُعتقد خطأً أن الهدايا يجب أن تكون غالية، بينما الأمر يتعلق بالقيمة العاطفية.",
            "قد يفترض الناس أن تلقي الهدايا يقتصر على المناسبات الخاصة، لكن الإيماءات العفوية مهمة بنفس القدر.",
            "قد يعتقد الشركاء أنه إذا تم تقديم هدية كبيرة واحدة، فإنهم ليسوا بحاجة لتقديم المزيد، ولكن الهدايا الصغيرة المنتظمة تكون ذات قيمة.",
            "يعتقد البعض أن الهدايا مادية بحتة، ولكن يمكن أن تكون رمزية وتعبر عن الحب والرعاية."
        ],
          "tips": [
            "انتبه للأشياء التي يذكرها شريكك ويريدها أو يحتاجها، وفاجئه بها لاحقًا.",
            "احتفظ بقائمة بالأشياء التي تجعل شريكك سعيدًا، واستخدمها لاختيار الهدايا.",
            "فكر في تقديم هدايا تتعلق بالذكريات المشتركة، مثل ألبوم صور أو تذكار.",
            "خصص الهدايا لتعكس اهتمامات شريكك الفريدة أو تفضيلاته.",
            "فاجئ شريكك بهدايا صغيرة ومدروسة مثل وجبته المفضلة أو كتاب كان يتطلع إليه."
        ],
          "examples": [
            "قدم كتابًا من مؤلفه المفضل، لتظهر أنك تتذكر اهتماماته.",
            "فاجئ شريكك بوجبة خفيفة مفضلة أو باقة زهور بعد يوم طويل.",
            "احتفل بذكرى معينة عن طريق إهداء شيء ذو معنى من علاقتكما، مثل صورة مؤطرة.",
            "اشتر تذاكر لحضور حدث كان ينتظره، مثل حفلة موسيقية أو عرض.",
            "قدم هدية مخصصة، مثل قطعة مجوهرات مصممة خصيصًا أو تذكار منقوش."
        ]
    }
}
      