{
    "1": {
        "style": "Evitación",
        "description": "La evitación es un estilo de manejo de conflictos en el que los individuos evitan abordar el conflicto, esperando que se resuelva solo sin confrontación.",
        "dos": [
            "Usa la evitación cuando el problema es menor y no vale la pena escalarlo.",
            "Elige la evitación si las emociones están muy intensas para tener una conversación productiva.",
            "Evita el conflicto cuando el momento es inapropiado o necesitas más tiempo para pensar.",
            "Usa la evitación cuando necesites calmarte y obtener una nueva perspectiva.",
            "Aléjate cuando estés lidiando con situaciones muy sensibles o volátiles donde la confrontación inmediata podría ser dañina."
        ],
        "donts": [
            "No uses la evitación para escapar de problemas serios que necesitan ser abordados.",
            "Evita usar la evitación como una solución a largo plazo, lo que puede llevar a tensiones no resueltas.",
            "No desestimes los sentimientos de tu pareja ignorando conflictos que le importan.",
            "No evites todas las formas de confrontación, ya que esto puede crear distancia y resentimiento.",
            "Evita dar el tratamiento de silencio, ya que puede aumentar la tensión emocional y los malentendidos."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja que necesitas tiempo para procesar tus sentimientos antes de discutir el conflicto.",
            "Explica que evitar el problema en este momento es tu manera de asegurarte de no escalar la discusión.",
            "Reafirma que tu intención es abordar el tema cuando estés más preparado para manejarlo con calma.",
            "Explica que no estás ignorando sus preocupaciones, pero necesitas algo de espacio para ordenar tus pensamientos.",
            "Programa un momento para retomar la conversación, dejando claro que la evitación es temporal."
        ],
        "commonMisunderstandings": [
            "Las personas a menudo piensan que la evitación significa ignorar el problema por completo, pero también puede ser una estrategia para calmarse.",
            "La evitación se percibe como falta de interés, pero puede ser una forma de prevenir conflictos innecesarios.",
            "Algunos creen que la evitación siempre lleva a problemas no resueltos, pero puede dar espacio para pensar con mayor claridad.",
            "Las parejas pueden malinterpretar la evitación como desinterés, cuando en realidad puede ser un método de manejo de conflictos.",
            "Puede percibirse como desapego emocional, cuando de hecho la evitación puede ser una manera de autopreservación en momentos estresantes."
        ],
        "tips": [
            "Usa la evitación de manera estratégica: asegúrate de retomar el tema cuando estés listo para abordarlo con calma.",
            "Comunica abiertamente por qué estás eligiendo evitar el conflicto temporalmente.",
            "Sé consciente de la necesidad de tu pareja de resolver el problema y no la dejes en la oscuridad por mucho tiempo.",
            "Encuentra maneras saludables de procesar tus sentimientos, como escribir un diario o hablar con una tercera persona neutral.",
            "La evitación funciona mejor cuando se combina con el compromiso de abordar el problema en un momento más adecuado."
        ],
        "examples": [
            "Aléjate de una discusión cuando las emociones estén intensas y sugiere retomar la conversación más tarde.",
            "Si tu pareja menciona un problema en un momento estresante, explícale que prefieres hablar de ello cuando ambos estén más tranquilos.",
            "Aléjate de un acalorado debate familiar para evitar escalar la situación.",
            "Decide no confrontar a un compañero de trabajo por una pequeña molestia, eligiendo dejarlo pasar.",
            "Evita mencionar un problema menor cuando sabes que tu pareja ya está abrumada con otros temas."
        ]
    },
    "2": {
        "style": "Acomodación",
        "description": "La acomodación es un estilo de manejo de conflictos en el que una persona cede a los deseos o necesidades de la otra para mantener la paz y evitar el conflicto.",
        "dos": [
            "Usa la acomodación cuando el problema es menor y priorizas la relación sobre tener la razón.",
            "Acomódate cuando tu pareja sienta algo con fuerza y estés dispuesto a ceder.",
            "Elige la acomodación para calmar una situación y mantener la armonía, especialmente en momentos tensos.",
            "Muestra acomodación cuando tu pareja necesita apoyo y puedes dejar pasar el problema.",
            "Sé flexible en acomodarte a las preferencias de tu pareja para fortalecer la relación."
        ],
        "donts": [
            "No te acomodes a expensas de tus propias necesidades o sentimientos, lo que puede llevar a resentimientos.",
            "Evita hacer de la acomodación tu enfoque predeterminado, ya que puede evitar que expreses tus propias preocupaciones.",
            "No cedas si el problema es crítico para tu bienestar o felicidad a largo plazo.",
            "Refrénate de acomodarte para evitar todos los conflictos, ya que puede crear un desequilibrio en la relación.",
            "Evita fingir que estás de acuerdo solo para evitar la confrontación."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja que estás dispuesto a acomodar sus necesidades porque valoras su felicidad.",
            "Expresa que, aunque estás de acuerdo en dejar pasar este tema, apreciarías una comprensión mutua en el futuro.",
            "Comunica que acomodar sus deseos ahora no significa que siempre lo harás: es algo situacional.",
            "Reafirma que la acomodación no se trata de ceder, sino de encontrar un equilibrio en ese momento.",
            "Hazle saber cuándo te estás acomodando porque el tema no es tan importante para ti como lo es para ellos."
        ],
        "commonMisunderstandings": [
            "Las personas a menudo piensan que la acomodación significa ser siempre un 'pusilánime', pero se trata de elegir tus batallas.",
            "La acomodación se malinterpreta como una señal de debilidad, cuando en realidad muestra inteligencia emocional.",
            "Algunos creen que la acomodación significa que no te importan tus propias necesidades, pero puede ser un acto desinteresado de amor.",
            "Las parejas pueden malinterpretar la acomodación como una evitación del problema, cuando en realidad se trata de priorizar la armonía en la relación.",
            "La gente puede suponer que la acomodación significa que no tienes opiniones fuertes, cuando en realidad estás eligiendo la paz sobre la confrontación."
        ],
        "tips": [
            "Usa la acomodación cuando la relación sea más importante que ganar la discusión.",
            "Sé claro sobre por qué estás acomodando para evitar sentir resentimiento más tarde.",
            "Asegúrate de equilibrar la acomodación con momentos en los que afirmes tus propias necesidades.",
            "Practica la acomodación en situaciones donde ceder te parezca razonable y justo.",
            "Haz una autoevaluación para asegurarte de que no estás acomodando por miedo al conflicto."
        ],
        "examples": [
            "Accede a ver la película favorita de tu pareja, aunque no sea tu primera opción.",
            "Deja que tu pareja elija el destino de vacaciones porque es más importante para ellos.",
            "Acomódate a la elección de cena de tu pareja, aunque no sea tu restaurante favorito.",
            "Cede en la opinión durante una pequeña discusión para mantener la paz.",
            "Reorganiza tus planes de fin de semana para apoyar las necesidades de tu pareja."
        ]
    },
    "3": {
        "style": "Compromiso",
        "description": "El compromiso es un estilo de manejo de conflictos en el que ambas partes hacen concesiones para encontrar un punto medio y llegar a un acuerdo que satisfaga a ambas partes en cierta medida.",
        "dos": [
            "Usa el compromiso cuando ambas partes tienen puntos válidos y es importante encontrar una solución justa.",
            "Sugiere dividir las diferencias o compartir responsabilidades para llegar a un punto medio.",
            "Fomenta el dar y recibir, permitiendo que ambas partes se sientan escuchadas y respetadas.",
            "Propón compromisos en situaciones en las que ambos sean flexibles y estén dispuestos a hacer sacrificios.",
            "Apunta a soluciones donde ambas partes se sientan satisfechas con el resultado."
        ],
        "donts": [
            "No uses el compromiso como una forma de evitar discusiones profundas o conflictos necesarios.",
            "Evita comprometer valores o principios fundamentales que son importantes para ti.",
            "No propongas un compromiso si una de las partes se sentirá desproporcionadamente insatisfecha.",
            "No trates el compromiso como una solución rápida sin considerar verdaderamente ambos lados.",
            "Evita usar el compromiso como una forma de escapar de la responsabilidad o el compromiso."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja que estás abierto a encontrar un terreno común que funcione para ambos.",
            "Expresa que aunque estás dispuesto a ceder algo, te gustaría que ellos hicieran lo mismo por equilibrio.",
            "Comunica que el compromiso se trata de equidad y valoras igualmente ambas perspectivas.",
            "Reafirma a tu pareja que estás comprometido a encontrar una solución que beneficie a ambos.",
            "Sugiere áreas donde ambos puedan hacer sacrificios para encontrarse a mitad de camino."
        ],
        "commonMisunderstandings": [
            "Las personas piensan que el compromiso siempre es 50/50, pero puede variar según la situación.",
            "El compromiso puede verse como una solución débil, pero se trata de equidad y equilibrio.",
            "Algunos creen que el compromiso significa que ninguna de las partes obtiene lo que quiere, pero se trata de satisfacción mutua.",
            "A menudo se malinterpreta que el compromiso se trata de ceder, cuando en realidad es para crear armonía.",
            "Las parejas pueden creer que el compromiso solo beneficia a un lado, pero cuando se hace bien, ambas partes deberían sentirse contentas."
        ],
        "tips": [
            "Esté dispuesto a dejar de lado preferencias menores para lograr un resultado más armonioso.",
            "Asegúrate de que ambas partes sean escuchadas y respetadas antes de proponer un compromiso.",
            "Busca soluciones donde ambas partes puedan salir sintiéndose valoradas.",
            "Usa el compromiso en situaciones donde la flexibilidad es posible sin sacrificar necesidades fundamentales.",
            "Recuerda que el compromiso no siempre tiene que ser igual: se trata de encontrar lo que funcione mejor para ambos."
        ],
        "examples": [
            "Sugiere dividir el tiempo entre dos destinos de vacaciones si tú y tu pareja tienen preferencias diferentes.",
            "Accede a ver una película que no te encanta, pero elijan la próxima juntos.",
            "Comprométete en un presupuesto donde ambas partes hagan pequeños sacrificios para acomodar objetivos compartidos.",
            "Accede a pasar tiempo con ambas familias durante las fiestas en lugar de elegir solo una.",
            "Ofrece intercambiar tareas o responsabilidades para equilibrar la carga de trabajo en el hogar."
        ]
    },
    "4": {
        "style": "Colaboración",
        "description": "La colaboración es un estilo de manejo de conflictos en el que ambas partes trabajan juntas para encontrar una solución de ganar-ganar que satisfaga completamente las necesidades de ambos individuos.",
        "dos": [
            "Usa la colaboración cuando ambas partes estén comprometidas a encontrar el mejor resultado posible.",
            "Colabora cuando el conflicto sea complejo y requiera aportes de ambos lados para una solución exitosa.",
            "Fomenta la comunicación abierta donde ambas partes se sientan seguras para expresar sus necesidades y deseos.",
            "Busca soluciones que aborden completamente las preocupaciones de ambas personas.",
            "Prioriza el trabajo en equipo para crear un resultado que beneficie a ambos lados por igual."
        ],
        "donts": [
            "No uses la colaboración si alguna de las partes no está dispuesta a comprometerse o comunicarse abiertamente.",
            "Evita la colaboración en situaciones sensibles al tiempo donde se necesita una decisión rápida.",
            "No dejes que el proceso de colaboración se vuelva demasiado complicado o prolongado.",
            "Refrénate de colaborar si una de las partes siente que debe renunciar a demasiado por el bien del otro.",
            "Evita usar la colaboración si alguna de las partes siente que sus necesidades fundamentales están siendo descuidadas."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja que quieres trabajar juntos para encontrar una solución que satisfaga a ambos.",
            "Expresa tu apertura para escuchar sus ideas y preocupaciones antes de tomar decisiones.",
            "Reafirma a tu pareja que la colaboración se trata de trabajo en equipo y de asegurar que ambos estén contentos con el resultado.",
            "Comunica una disposición para explorar múltiples opciones para llegar a un acuerdo compartido.",
            "Fomenta la lluvia de ideas y la resolución de problemas como una forma de abordar el problema desde todos los ángulos."
        ],
        "commonMisunderstandings": [
            "Las personas a menudo piensan que la colaboración lleva demasiado tiempo, pero puede llevar a soluciones duraderas.",
            "La colaboración se malinterpreta como compromiso, pero se trata de encontrar la mejor solución sin sacrificar necesidades fundamentales.",
            "Algunos creen que la colaboración solo funciona en situaciones ideales, pero puede ser efectiva en muchos tipos de conflictos.",
            "Las parejas pueden pensar que la colaboración requiere demasiado esfuerzo, pero a menudo conduce a los resultados más satisfactorios.",
            "A menudo se asume que la colaboración significa que ambas partes deben estar de acuerdo al 100%, pero se trata más de satisfacción mutua."
        ],
        "tips": [
            "Aborda la colaboración con una mentalidad de curiosidad y resolución de problemas.",
            "Concéntrate en escuchar activamente y asegurarte de que ambas partes se sientan escuchadas y comprendidas.",
            "Usa la colaboración en situaciones donde encontrar la mejor solución sea más importante que una resolución rápida.",
            "Sé paciente y mantente abierto de mente cuando trabajes en un proceso colaborativo.",
            "Reconoce que la colaboración a menudo resulta en relaciones más fuertes y significativas."
        ],
        "examples": [
            "Trabajen juntos para planificar unas vacaciones familiares donde se consideren las preferencias de todos.",
            "Colaboren en un presupuesto del hogar donde se aborden completamente las necesidades de ambos.",
            "Crea un horario compartido que tenga en cuenta los compromisos y deseos de ambos.",
            "Colabora en la decoración de tu hogar mezclando ambos estilos.",
            "Trabaja con tu pareja para encontrar una solución al equilibrio entre el trabajo y la vida que satisfaga a ambos."
        ]
    },
    "5": {
        "style": "Competencia",
        "description": "La competencia es un estilo de manejo de conflictos en el que una persona busca ganar el argumento o hacer valer su perspectiva, a menudo priorizando sus propias necesidades sobre las de los demás.",
        "dos": [
            "Usa la competencia cuando se necesiten decisiones rápidas y no haya tiempo para la colaboración.",
            "Afirmar tu punto de vista cuando el tema sea importante para ti y un compromiso te dejaría insatisfecho.",
            "Compite en situaciones donde necesites defenderte o proteger tus valores.",
            "Usa la competencia en entornos profesionales donde se requiere un liderazgo claro.",
            "Compite cuando sea esencial obtener resultados, como en negociaciones o acuerdos comerciales de alto riesgo."
        ],
        "donts": [
            "No uses la competencia como estilo predeterminado, ya que puede tensar las relaciones.",
            "Evita competir por temas menores donde el compromiso o la colaboración serían más efectivos.",
            "No compitas si eso significa desatender completamente las necesidades de los demás involucrados.",
            "Refrénate de usar la competencia en asuntos emocionales o personales, ya que puede llevar al resentimiento.",
            "Evita competir si la relación es más importante que el resultado de la discusión."
        ],
        "howToCommunicate": [
            "Hazle saber a tu pareja por qué este tema es particularmente importante para ti y por qué te mantienes firme.",
            "Expresa que aunque valoras su opinión, sientes con fuerza la necesidad de mantener tu posición.",
            "Comunica que la competencia es necesaria en este caso debido a la importancia del tema.",
            "Explica que no estás tratando de desestimar su perspectiva, pero que este es un tema no negociable para ti.",
            "Reafirma a tu pareja que tu postura competitiva no significa que no te importe sus sentimientos."
        ],
        "commonMisunderstandings": [
            "Las personas a menudo piensan que la competencia siempre es dañina, pero puede ser útil en las situaciones correctas.",
            "La competencia se malinterpreta como egoísmo, cuando en realidad puede ser sobre mantenerse firme en temas importantes.",
            "Algunos creen que la competencia siempre daña las relaciones, pero puede generar respeto si se usa adecuadamente.",
            "Las parejas pueden asumir que la competencia se trata de ganar, pero puede ser sobre garantizar un resultado justo.",
            "A menudo se asume que la competencia significa desatender completamente las necesidades de los demás, lo cual no siempre es el caso."
        ],
        "tips": [
            "Usa la competencia con moderación y solo cuando sea realmente necesario para afirmarte.",
            "Sé claro sobre por qué estás tomando una postura competitiva para evitar malentendidos.",
            "Equilibra la competencia con la empatía: reconoce los sentimientos de la otra persona, incluso si no estás de acuerdo.",
            "Reconoce cuándo la competencia está dañando la relación y sé dispuesto a dar un paso atrás si es necesario.",
            "Sé estratégico con la competencia: úsala para alcanzar metas importantes sin causar conflictos innecesarios."
        ],
        "examples": [
            "Mantén tu posición en una negociación comercial donde comprometerte significaría una pérdida.",
            "Afirmar tu opinión durante una reunión de equipo para garantizar que tu voz sea escuchada en un tema crítico.",
            "Compite por una promoción en el trabajo donde sientes que eres el mejor candidato.",
            "Mantén firme en una decisión familiar cuando creas que el resultado beneficiará a todos a largo plazo.",
            "Toma el liderazgo en un proyecto donde tu experiencia te convierte en la persona más calificada para tomar decisiones."
        ]
    }
}