{
    "1": {
        "style": "Evasão",
        "description": "A evasão é um estilo de gerenciamento de conflitos onde os indivíduos evitam abordar o conflito, esperando que ele se resolva por conta própria, sem confronto.",
        "dos": [
            "Use a evasão quando o problema for pequeno e não valer a pena escalar.",
            "Escolha a evasão se as emoções estiverem muito intensas para ter uma conversa produtiva.",
            "Evite o conflito quando o momento não for apropriado ou você precisar de mais tempo para pensar.",
            "Use a evasão quando precisar se acalmar e obter uma nova perspectiva.",
            "Afaste-se ao lidar com situações altamente sensíveis ou voláteis onde o confronto imediato pode ser prejudicial."
        ],
        "donts": [
            "Não use a evasão para fugir de questões sérias que precisam ser abordadas.",
            "Evite usar a evasão como solução de longo prazo, pois isso pode levar a tensões não resolvidas.",
            "Não desconsidere os sentimentos do seu parceiro ignorando conflitos que são importantes para ele.",
            "Não evite todas as formas de confronto, pois isso pode criar distanciamento e ressentimento.",
            "Evite o tratamento de silêncio, pois pode aumentar a tensão emocional e os mal-entendidos."
        ],
        "howToCommunicate": [
            "Informe ao seu parceiro que você precisa de tempo para processar seus sentimentos antes de discutir o conflito.",
            "Explique que evitar o problema no momento é sua maneira de garantir que não vai piorar a discussão.",
            "Reafirme que pretende abordar a questão quando estiver mais preparado para lidar com calma.",
            "Explique que você não está ignorando as preocupações dele, mas precisa de espaço para organizar seus pensamentos.",
            "Marque um horário para retomar a conversa, deixando claro que a evasão é temporária."
        ],
        "commonMisunderstandings": [
            "As pessoas frequentemente pensam que evasão significa ignorar completamente o problema, mas pode ser uma estratégia para acalmar os ânimos.",
            "A evasão é vista como falta de cuidado, mas pode ser uma maneira de evitar conflitos desnecessários.",
            "Alguns acreditam que a evasão sempre leva a problemas não resolvidos, mas pode dar espaço para pensar com mais clareza.",
            "Parceiros podem interpretar a evasão como desinteresse, quando na verdade pode ser um método de gerenciamento de conflitos.",
            "Pode ser percebido como desapego emocional, quando na verdade a evasão pode ser autopreservação em momentos de estresse."
        ],
        "tips": [
            "Use a evasão de maneira estratégica - certifique-se de retomar o assunto quando estiver pronto para lidar com ele com calma.",
            "Comunique abertamente por que você está escolhendo evitar o conflito temporariamente.",
            "Esteja atento à necessidade do seu parceiro de resolver o problema e não o deixe no escuro por muito tempo.",
            "Encontre maneiras saudáveis de processar seus sentimentos, como escrever em um diário ou conversar com uma terceira pessoa neutra.",
            "A evasão funciona melhor quando combinada com o compromisso de abordar o problema em um momento mais apropriado."
        ],
        "examples": [
            "Afastar-se de uma discussão quando as emoções estiverem altas e sugerir retomar a conversa mais tarde.",
            "Se o seu parceiro levantar um problema em um momento estressante, explique que prefere discutir isso quando ambos estiverem mais calmos.",
            "Sair de um debate acalorado em uma reunião de família para evitar escalar a situação.",
            "Decidir não confrontar um colega de trabalho sobre um pequeno aborrecimento, optando por deixar passar.",
            "Evitar mencionar um problema menor quando souber que seu parceiro já está sobrecarregado com outras coisas."
        ]
    },
    "2": {
        "style": "Acomodação",
        "description": "A acomodação é um estilo de gerenciamento de conflitos onde uma pessoa cede aos desejos ou necessidades do outro para manter a paz e evitar conflitos.",
        "dos": [
            "Use a acomodação quando o problema for pequeno e você priorizar o relacionamento em vez de estar certo.",
            "Acomode-se quando seu parceiro sentir algo com muita força e você estiver disposto a ceder.",
            "Escolha a acomodação para acalmar uma situação e manter a harmonia, especialmente em momentos de tensão.",
            "Mostre acomodação quando seu parceiro precisar de apoio e você puder abrir mão do problema.",
            "Seja flexível ao acomodar as preferências do seu parceiro para fortalecer o relacionamento."
        ],
        "donts": [
            "Não se acomode às custas de suas próprias necessidades ou sentimentos, o que pode levar a ressentimento.",
            "Evite fazer da acomodação sua abordagem padrão, pois pode impedir que você expresse suas preocupações.",
            "Não ceda se o problema for crucial para seu bem-estar ou felicidade a longo prazo.",
            "Abstenha-se de se acomodar para evitar todos os conflitos, pois isso pode criar desequilíbrio no relacionamento.",
            "Evite fingir concordar com algo apenas para evitar a confrontação."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que você está disposto a acomodar suas necessidades porque valoriza sua felicidade.",
            "Explique que, embora você esteja disposto a deixar passar esse problema, apreciaria uma compreensão mútua no futuro.",
            "Comunique que acomodar os desejos dele agora não significa que você sempre fará isso – é situacional.",
            "Reafirme que acomodação não é sobre desistir, mas sobre encontrar equilíbrio no momento.",
            "Informe ao seu parceiro quando você está se acomodando porque o assunto não é tão importante para você quanto é para ele."
        ],
        "commonMisunderstandings": [
            "As pessoas frequentemente pensam que a acomodação significa ser um 'capacho', mas trata-se de escolher suas batalhas.",
            "A acomodação é mal interpretada como um sinal de fraqueza, quando na verdade mostra inteligência emocional.",
            "Alguns acreditam que a acomodação significa que você não se importa com suas próprias necessidades, mas pode ser um ato altruísta de amor.",
            "Parceiros podem interpretar a acomodação como uma forma de evitar o problema, quando na verdade se trata de priorizar a harmonia no relacionamento.",
            "As pessoas podem supor que a acomodação significa que você não tem opiniões fortes, quando na verdade você está escolhendo a paz em vez da confrontação."
        ],
        "tips": [
            "Use a acomodação quando o relacionamento for mais importante do que ganhar o argumento.",
            "Seja claro sobre por que você está se acomodando para evitar sentir ressentimento mais tarde.",
            "Certifique-se de equilibrar a acomodação com momentos em que você afirma suas próprias necessidades.",
            "Pratique acomodação em situações onde ceder parece razoável e justo.",
            "Verifique consigo mesmo para garantir que você não está se acomodando por medo de conflitos."
        ],
        "examples": [
            "Concorde em assistir ao filme favorito do seu parceiro, mesmo que não seja sua primeira escolha.",
            "Deixe seu parceiro escolher o destino das férias porque é mais importante para ele.",
            "Acomode-se na escolha do jantar, mesmo que não seja o seu restaurante favorito.",
            "Ceda à opinião do seu parceiro durante uma pequena discussão para manter a paz.",
            "Reorganize seus planos de fim de semana para apoiar as necessidades do seu parceiro."
        ]
    },
    "3": {
        "style": "Compromisso",
        "description": "O compromisso é um estilo de gerenciamento de conflitos onde ambas as partes fazem concessões para encontrar um meio-termo e chegar a um acordo que satisfaça ambas as partes em certa medida.",
        "dos": [
            "Use o compromisso quando ambas as partes tiverem pontos válidos e for importante encontrar uma solução justa.",
            "Sugira dividir as diferenças ou compartilhar responsabilidades para chegar a um meio-termo.",
            "Incentive o dar e receber, permitindo que ambas as partes se sintam ouvidas e respeitadas.",
            "Proponha compromissos em situações onde ambos sejam flexíveis e dispostos a fazer sacrifícios.",
            "Busque soluções onde ambas as partes saiam da discussão satisfeitas com o resultado."
        ],
        "donts": [
            "Não use o compromisso como uma forma de evitar discussões profundas ou conflitos necessários.",
            "Evite comprometer valores ou princípios fundamentais que sejam importantes para você.",
            "Não proponha um compromisso se uma das partes sair desproporcionalmente insatisfeita.",
            "Não trate o compromisso como uma solução rápida sem realmente considerar os dois lados.",
            "Evite usar o compromisso como uma forma de escapar da responsabilidade ou prestação de contas."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que está aberto a encontrar um meio-termo que funcione para ambos.",
            "Explique que, embora você esteja disposto a ceder algo, gostaria que ele fizesse o mesmo por equilíbrio.",
            "Comunique que o compromisso se trata de equidade e que você valoriza igualmente ambas as perspectivas.",
            "Reafirme ao seu parceiro que está comprometido em encontrar uma solução que beneficie os dois.",
            "Sugira áreas onde ambos possam fazer sacrifícios para se encontrarem no meio do caminho."
        ],
        "commonMisunderstandings": [
            "As pessoas pensam que o compromisso é sempre 50/50, mas pode variar dependendo da situação.",
            "O compromisso pode ser visto como uma solução fraca, mas se trata de equidade e equilíbrio.",
            "Alguns acreditam que o compromisso significa que nenhuma das partes consegue o que quer, mas se trata de satisfação mútua.",
            "É frequentemente mal interpretado que o compromisso se trata de ceder, quando na verdade é para criar harmonia.",
            "Parceiros podem acreditar que o compromisso só beneficia um lado, mas quando feito corretamente, ambos devem se sentir satisfeitos."
        ],
        "tips": [
            "Esteja disposto a abrir mão de preferências menores para alcançar um resultado mais harmonioso.",
            "Certifique-se de que ambas as partes sejam ouvidas e respeitadas antes de propor um compromisso.",
            "Procure soluções onde ambas as partes possam sair se sentindo valorizadas.",
            "Use o compromisso em situações onde a flexibilidade é possível sem sacrificar necessidades fundamentais.",
            "Lembre-se de que o compromisso não precisa ser sempre igual: trata-se de encontrar o que funciona melhor para ambos."
        ],
        "examples": [
            "Sugira dividir o tempo entre dois destinos de férias se você e seu parceiro tiverem preferências diferentes.",
            "Aceite assistir a um filme que você não ama, mas escolha o próximo juntos.",
            "Comprometa-se com um orçamento onde ambas as partes façam pequenos sacrifícios para acomodar metas compartilhadas.",
            "Concorde em passar tempo com ambas as famílias durante as festas, em vez de escolher apenas uma.",
            "Ofereça trocar tarefas ou responsabilidades para equilibrar a carga de trabalho em casa."
        ]
    },
    "4": {
        "style": "Colaboração",
        "description": "A colaboração é um estilo de gerenciamento de conflitos onde ambas as partes trabalham juntas para encontrar uma solução em que todos ganham, satisfazendo completamente as necessidades de ambos os indivíduos.",
        "dos": [
            "Use a colaboração quando ambas as partes estiverem comprometidas em encontrar o melhor resultado possível.",
            "Colabore quando o conflito for complexo e exigir a contribuição de ambos os lados para uma solução bem-sucedida.",
            "Incentive a comunicação aberta, onde ambas as partes se sintam seguras para expressar suas necessidades e desejos.",
            "Procure soluções que abordem completamente as preocupações de ambas as pessoas.",
            "Priorize o trabalho em equipe para criar um resultado que beneficie igualmente os dois lados."
        ],
        "donts": [
            "Não use a colaboração se uma das partes não estiver disposta a comprometer-se ou comunicar-se abertamente.",
            "Evite a colaboração em situações urgentes, onde uma decisão rápida é necessária.",
            "Não deixe que o processo de colaboração se torne excessivamente complicado ou prolongado.",
            "Evite colaborar se uma das partes sentir que precisa abrir mão de muito em prol da outra.",
            "Evite usar a colaboração se uma das partes sentir que suas necessidades fundamentais estão sendo negligenciadas."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro que você quer trabalhar juntos para encontrar uma solução que satisfaça a ambos.",
            "Expresse sua abertura para ouvir suas ideias e preocupações antes de tomar qualquer decisão.",
            "Reafirme ao seu parceiro que a colaboração se trata de trabalho em equipe e garantir que ambos fiquem satisfeitos com o resultado.",
            "Comunique disposição para explorar várias opções para chegar a um acordo comum.",
            "Incentive o brainstorming e a resolução de problemas como forma de abordar a questão sob todos os ângulos."
        ],
        "commonMisunderstandings": [
            "As pessoas frequentemente pensam que a colaboração leva muito tempo, mas pode levar a soluções duradouras.",
            "A colaboração é mal interpretada como compromisso, mas se trata de encontrar a melhor solução sem sacrificar necessidades fundamentais.",
            "Alguns acreditam que a colaboração só funciona em situações ideais, mas pode ser eficaz em muitos tipos de conflitos.",
            "Parceiros podem pensar que a colaboração requer muito esforço, mas muitas vezes leva aos resultados mais satisfatórios.",
            "É frequentemente assumido que a colaboração significa que ambas as partes devem concordar 100%, mas se trata mais de satisfação mútua."
        ],
        "tips": [
            "Aborde a colaboração com uma mentalidade de curiosidade e resolução de problemas.",
            "Concentre-se em ouvir ativamente e garantir que ambas as partes se sintam ouvidas e compreendidas.",
            "Use a colaboração em situações onde encontrar a melhor solução é mais importante do que uma resolução rápida.",
            "Seja paciente e mantenha a mente aberta ao trabalhar em um processo colaborativo.",
            "Reconheça que a colaboração frequentemente resulta em relacionamentos mais fortes e significativos."
        ],
        "examples": [
            "Trabalhe juntos para planejar umas férias em família onde as preferências de todos sejam consideradas.",
            "Colabore em um orçamento doméstico onde as necessidades de ambos sejam completamente abordadas.",
            "Crie um cronograma compartilhado que leve em consideração os compromissos e desejos de ambos.",
            "Colabore na decoração de sua casa misturando os estilos de ambos.",
            "Trabalhe com seu parceiro para encontrar uma solução de equilíbrio entre trabalho e vida pessoal que satisfaça a ambos."
        ]
    },
    "5": {
        "style": "Competição",
        "description": "A competição é um estilo de gerenciamento de conflitos onde uma pessoa busca ganhar o argumento ou afirmar sua perspectiva, muitas vezes priorizando suas próprias necessidades sobre as dos outros.",
        "dos": [
            "Use a competição quando decisões rápidas forem necessárias e não houver tempo para colaboração.",
            "Afirme seu ponto de vista quando o problema for importante para você e o compromisso o deixaria insatisfeito.",
            "Compita em situações onde você precise se defender ou proteger seus valores.",
            "Use a competição em ambientes profissionais onde uma liderança clara seja necessária.",
            "Compita quando for essencial obter resultados, como em negociações de alto risco ou acordos comerciais."
        ],
        "donts": [
            "Não use a competição como estilo padrão, pois pode prejudicar os relacionamentos.",
            "Evite competir por questões menores onde o compromisso ou a colaboração seriam mais eficazes.",
            "Não compita se isso significar desconsiderar completamente as necessidades dos outros envolvidos.",
            "Abstenha-se de usar a competição em assuntos emocionais ou pessoais, pois pode levar ao ressentimento.",
            "Evite competir se o relacionamento for mais importante do que o resultado da discussão."
        ],
        "howToCommunicate": [
            "Diga ao seu parceiro por que este problema é particularmente importante para você e por que você está firme.",
            "Expresse que, embora valorize sua opinião, você sente fortemente a necessidade de manter sua posição.",
            "Comunique que a competição é necessária neste caso devido à importância do problema.",
            "Explique que você não está tentando desconsiderar a perspectiva dele, mas que este é um ponto não negociável para você.",
            "Reafirme ao seu parceiro que sua postura competitiva não significa que você não se importe com os sentimentos dele."
        ],
        "commonMisunderstandings": [
            "As pessoas frequentemente pensam que a competição é sempre prejudicial, mas pode ser útil nas situações certas.",
            "A competição é mal interpretada como egoísmo, quando na verdade pode ser sobre se manter firme em questões importantes.",
            "Alguns acreditam que a competição sempre prejudica os relacionamentos, mas pode gerar respeito se usada adequadamente.",
            "Parceiros podem supor que a competição é sobre vencer, mas pode ser sobre garantir um resultado justo.",
            "Freqüentemente, assume-se que a competição significa desconsiderar completamente as necessidades dos outros, o que nem sempre é o caso."
        ],
        "tips": [
            "Use a competição com moderação e apenas quando for realmente necessário para se afirmar.",
            "Seja claro sobre por que você está adotando uma postura competitiva para evitar mal-entendidos.",
            "Equilibre a competição com empatia - reconheça os sentimentos da outra pessoa, mesmo que você não concorde.",
            "Reconheça quando a competição está prejudicando o relacionamento e esteja disposto a recuar, se necessário.",
            "Seja estratégico com a competição - use-a para alcançar metas importantes sem causar conflitos desnecessários."
        ],
        "examples": [
            "Mantenha sua posição em uma negociação comercial onde o compromisso levaria a uma perda.",
            "Afirme sua opinião durante uma reunião de equipe para garantir que sua voz seja ouvida em uma questão crítica.",
            "Compita por uma promoção no trabalho, onde você sente que é o melhor candidato.",
            "Mantenha-se firme em uma decisão familiar quando acreditar que o resultado beneficiará a todos a longo prazo.",
            "Assuma a liderança em um projeto onde sua experiência o torna a pessoa mais qualificada para tomar decisões."
        ]
    }
}