{
    "1": {
        "style": "Toucher Physique",
        "description": "Le toucher physique implique de montrer de l'amour par des gestes physiques tels que des câlins, des baisers, des caresses, et même des gestes simples comme une tape dans le dos ou une main sur l'épaule. C'est un moyen non verbal de montrer de l'affection et de renforcer les liens.",
        "dos": [
            "Tenez la main en public et en privé.",
            "Donnez régulièrement de longs câlins chaleureux pour montrer votre affection.",
            "Offrez un contact physique réconfortant en période de stress.",
            "Blottissez-vous ensemble pendant les moments de détente ou avant de dormir.",
            "Donnez des baisers spontanés, des massages ou des caresses douces."
        ],
        "donts": [
            "Évitez d'être physiquement distant ou de négliger le toucher.",
            "Ne retenez pas le contact physique comme une forme de punition (ex: refuser l'affection).",
            "Ne supposez pas que tout contact physique doit être sexuel.",
            "Évitez les gestes brusques ou négligents.",
            "Ne négligez pas les petits moments d'affection physique, comme tenir la main."
        ],
        "howToCommunicate": [
            "Dites à votre partenaire que la proximité physique vous fait vous sentir aimé et connecté.",
            "Exprimez l'importance des gestes non sexuels, comme se blottir ou tenir la main.",
            "Faites savoir à votre partenaire quand vous vous sentez déconnecté à cause d'un manque d'affection physique.",
            "Rassurez-le que des gestes simples, comme un câlin ou un baiser, peuvent faire une grande différence.",
            "Expliquez que le toucher physique vous réconforte en période de stress ou d'anxiété."
        ],
        "commonMisunderstandings": [
            "Les gens peuvent penser que le toucher physique est uniquement sexuel, alors qu'il s'agit d'une connexion émotionnelle non verbale.",
            "Certains peuvent penser que s'ils ne sont pas naturellement 'tactiles', leur partenaire ne s'en apercevra pas.",
            "On peut penser que la quantité de toucher est plus importante que la qualité.",
            "Les personnes qui apprécient le toucher physique peuvent paraître exigeantes alors qu'elles recherchent seulement de la connexion.",
            "Les partenaires peuvent croire que des gestes occasionnels suffisent, alors que la constance est essentielle."
        ],
        "tips": [
            "Touchez votre partenaire tout au long de la journée avec de petits gestes, comme un câlin rapide ou une tape dans le dos.",
            "Initiez un contact physique affectueux, même si votre partenaire ne le demande pas toujours.",
            "Utilisez le toucher physique pour vous reconnecter après une dispute ou dans des situations stressantes.",
            "Variez les gestes d'affection physique – les câlins, les baisers, tenir la main et se blottir sont tous importants.",
            "Faites attention au niveau de confort de votre partenaire et ajustez vos gestes en conséquence."
        ],
        "examples": [
            "Serrez votre partenaire dans vos bras dès que vous le voyez après une longue journée.",
            "Tenez la main en marchant ou en regardant la télévision ensemble.",
            "Blottissez-vous sur le canapé en regardant un film.",
            "Offrez un massage ou un câlin pour détendre votre partenaire.",
            "Posez une main réconfortante sur son épaule lors d'une conversation difficile."
        ]
    },
    "2": {
        "style": "Paroles d'Affirmation",
        "description": "Les paroles d'affirmation impliquent d'exprimer son amour et son appréciation par des mots, qu'ils soient prononcés ou écrits, offrant encouragements, compliments et renforcement positif pour valoriser votre partenaire.",
        "dos": [
            "Faites des compliments sincères sur leur personnalité, apparence ou réalisations.",
            "Offrez des mots d'encouragement lorsqu'ils poursuivent leurs objectifs.",
            "Exprimez régulièrement votre gratitude pour leurs efforts, petits ou grands.",
            "Écrivez des notes ou des messages attentionnés pour montrer votre appréciation.",
            "Dites à votre partenaire régulièrement combien il compte pour vous et pourquoi."
        ],
        "donts": [
            "Évitez les critiques sévères ou le langage négatif, qui peuvent profondément blesser.",
            "Ne faites pas de sarcasmes ou de blagues à ses dépens.",
            "Ne minimisez pas leurs émotions ou ne rejetez pas leurs sentiments.",
            "Évitez de retenir des mots gentils lorsque votre partenaire cherche de la réassurance verbale.",
            "N'utilisez jamais les mots comme une arme pour manipuler ou contrôler."
        ],
        "howToCommunicate": [
            "Faites savoir à votre partenaire que vous vous sentez aimé lorsqu'il exprime verbalement son appréciation.",
            "Expliquez que d'entendre des mots positifs et affirmatifs améliore votre humeur et renforce votre lien.",
            "Demandez-leur de partager des compliments ou des remerciements régulièrement, surtout lorsque vous vous sentez déprimé.",
            "Rassurez-les qu'un petit compliment ou un texte peut avoir un grand impact.",
            "Dites-leur que des mots d'encouragement vous motivent et vous font vous sentir valorisé."
        ],
        "commonMisunderstandings": [
            "Certaines personnes pensent que les paroles d'affirmation sont superficielles ou ne sont que de la flatterie.",
            "D'autres peuvent supposer que vous savez déjà qu'ils tiennent à vous et qu'ils n'ont pas besoin de le dire.",
            "Certains partenaires peuvent penser qu'une fois qu'ils ont dit 'Je t'aime', ils n'ont plus besoin de le dire souvent.",
            "Les paroles d'affirmation peuvent être perçues comme inutiles si le partenaire préfère montrer son amour par des actions.",
            "On peut mal comprendre que les paroles ne concernent pas seulement les éloges, mais aussi le soutien émotionnel."
        ],
        "tips": [
            "Laissez des notes d'amour surprises ou des messages attentionnés dans des endroits où votre partenaire les trouvera.",
            "Soyez précis dans vos compliments—cela montre que vous faites vraiment attention.",
            "Faites-en une habitude de dire quelque chose de positif chaque jour, même pendant les moments difficiles.",
            "Utilisez les textos pour envoyer des petits rappels de votre appréciation tout au long de la journée.",
            "Écoutez attentivement ce que votre partenaire valorise et reconnaissez-le verbalement."
        ],
        "examples": [
            "Dites 'J'apprécie à quel point tu travailles dur pour nous' après une longue journée de travail.",
            "Laissez une note dans son sac ou sa voiture disant, 'Tu es incroyable, et je suis chanceux(se) de t'avoir.'",
            "Complimentez leur tenue ou leur coiffure avant de sortir ensemble.",
            "Envoyez-lui un texto pendant la journée pour lui faire savoir que vous pensez à lui/elle.",
            "Célébrez ses réussites avec des mots d'encouragement comme 'Je suis tellement fier(ère) de toi!'"
        ]
    },
    "3": {
        "style": "Actes de Service",
        "description": "Les actes de service consistent à montrer son amour en accomplissant des actions utiles pour votre partenaire, comme faire les corvées, accomplir des tâches ou gérer des responsabilités pour alléger son fardeau.",
        "dos": [
            "Aidez avec les tâches quotidiennes comme cuisiner, nettoyer ou faire les courses sans qu'on vous le demande.",
            "Proposez de prendre en charge des responsabilités que votre partenaire trouve stressantes ou chronophages.",
            "Cherchez des occasions d'alléger son fardeau, comme organiser quelque chose ou planifier à l'avance.",
            "Accomplissez des tâches ou des projets qu'il/elle a mentionné vouloir faire mais n'a pas eu le temps.",
            "Soyez proactif—prévoyez ses besoins et agissez avant qu'il/elle ne doive demander."
        ],
        "donts": [
            "Ne faites pas de promesses d'aide pour ensuite ne pas les tenir.",
            "Évitez de faire les choses à contrecœur ou avec ressentiment—votre attitude est importante.",
            "Ne supposez pas qu'un grand geste annulera de petites actions constantes.",
            "Ne faites pas les choses en attendant des éloges—faites-le par amour, pas pour la reconnaissance.",
            "Évitez de critiquer la manière dont votre partenaire fait les choses s'il/elle propose d'aider."
        ],
        "howToCommunicate": [
            "Dites à votre partenaire que vous vous sentez aimé lorsque qu'il/elle aide avec les tâches quotidiennes ou prend des responsabilités.",
            "Expliquez que des actions comme gérer les corvées ou les courses montrent qu'il/elle se soucie de votre bien-être.",
            "Demandez-leur d'intervenir avec des tâches spécifiques, en le présentant comme une manière de vous soutenir émotionnellement.",
            "Faites-lui savoir que de petits actes de service, comme préparer un repas ou faire une course, comptent beaucoup pour vous.",
            "Rassurez-le/la que ses efforts n'ont pas besoin d'être des gestes grandioses—de petites actions constantes sont ce qui compte le plus."
        ],
        "commonMisunderstandings": [
            "Certaines personnes pensent que les actes de service consistent simplement à faire des corvées, mais il s'agit de faciliter la vie de votre partenaire.",
            "Les partenaires peuvent mal comprendre qu'offrir de l'aide sans qu'on la demande peut montrer de l'amour.",
            "On peut penser que les actes de service ne concernent que les tâches pratiques, mais le soutien émotionnel par l'action est essentiel.",
            "Certains pensent que si leur partenaire ne demande pas d'aide, il/elle n'en a pas besoin, mais anticiper ses besoins est important.",
            "Les gens peuvent croire que leurs propres efforts ne sont pas remarqués, alors qu'en réalité ils sont profondément appréciés."
        ],
        "tips": [
            "Préparez le plat préféré de votre partenaire comme surprise lors d'une journée difficile.",
            "Proposez de prendre en charge une tâche ou une responsabilité qui lui pèse.",
            "Pensez à ce que vous pouvez faire pour rendre sa journée plus facile, comme faire le plein d'essence ou aller chercher des courses.",
            "Faites régulièrement de petites tâches attentionnées pour montrer que vous pensez toujours à comment améliorer sa vie.",
            "Proposez d'aider avec des tâches que vous savez qu'il/elle n'aime pas, comme plier le linge ou sortir les poubelles."
        ],
        "examples": [
            "Préparez le dîner pour lui/elle après une longue journée.",
            "Prenez soin d'une réparation à la maison qui traîne sur sa liste de tâches depuis un moment.",
            "Faites la vaisselle ou le linge sans qu'on vous le demande.",
            "Accomplissez une course qu'il/elle redoute, comme aller à la poste.",
            "Organisez son espace de travail ou une pièce encombrée pour lui/elle apporter la tranquillité d'esprit."
        ]
    },
    "4": {
        "style": "Temps de Qualité",
        "description": "Le temps de qualité consiste à accorder à votre partenaire une attention pleine et entière, à passer des moments significatifs ensemble, et à partager des expériences qui renforcent votre connexion.",
        "dos": [
            "Planifiez des rendez-vous réguliers ou des activités qui permettent une conversation significative.",
            "Rangez les distractions, comme votre téléphone, et concentrez-vous entièrement sur votre partenaire.",
            "Participez à des activités que vous aimez tous les deux, comme cuisiner, faire de la randonnée ou jouer à des jeux ensemble.",
            "Posez des questions ouvertes qui encouragent votre partenaire à partager ses pensées et ses sentiments.",
            "Montrez de l'intérêt pour ses hobbies et trouvez des moyens d'y participer ensemble."
        ],
        "donts": [
            "Évitez de faire plusieurs choses à la fois lorsque vous passez du temps ensemble (ex: consulter votre téléphone).",
            "Ne négligez pas le temps en tête-à-tête régulier, même lorsque la vie devient chargée.",
            "Ne soyez pas passif ou désintéressé lors des activités partagées.",
            "Ne laissez pas les distractions ou les interruptions vous détourner de votre partenaire.",
            "Évitez de reprogrammer ou d'annuler souvent des plans, cela peut donner à votre partenaire l'impression de ne pas être important."
        ],
        "howToCommunicate": [
            "Dites à votre partenaire que vous vous sentez le plus aimé(e) lorsqu'il/elle vous consacre du temps exclusivement.",
            "Expliquez que l'attention sans partage, même pour une courte durée, vous fait vous sentir valorisé(e) et apprécié(e).",
            "Demandez des moments réguliers où vous pouvez tous les deux vous déconnecter des distractions et vous concentrer l'un sur l'autre.",
            "Partagez avec lui/elle que des activités simples, comme parler ou partager un repas, renforcent votre lien.",
            "Rassurez-le/la que la qualité du temps passé ensemble compte plus que la quantité."
        ],
        "commonMisunderstandings": [
            "Les gens pensent souvent que le temps de qualité est une question de quantité, alors qu'il s'agit davantage de présence émotionnelle.",
            "Certains partenaires peuvent supposer que passer du temps dans la même pièce est suffisant, mais l'attention concentrée est ce qui compte.",
            "On croit souvent que le temps de qualité doit inclure des sorties extravagantes, mais les moments simples sont tout aussi précieux.",
            "Les partenaires peuvent penser que des activités passives, comme regarder la télévision ensemble, répondent au besoin de temps de qualité, mais l'engagement actif est essentiel.",
            "Certains peuvent penser que parler des tâches quotidiennes compte comme du temps de qualité, mais il s'agit de connexion plus profonde."
        ],
        "tips": [
            "Réservez du temps chaque semaine pour une activité ou un rendez-vous sans téléphone.",
            "Planifiez une excursion d'une journée ou une aventure où vous pouvez tous les deux vivre quelque chose de nouveau.",
            "Surprenez votre partenaire avec un rendez-vous ou une activité qu'il/elle apprécie.",
            "Participez à ses hobbies ou centres d'intérêt, même s'ils sont différents des vôtres.",
            "Planifiez une 'staycation' où vous passez du temps ininterrompu ensemble à la maison."
        ],
        "examples": [
            "Faites une longue promenade ensemble et parlez de votre journée ou de vos rêves.",
            "Prenez un dîner sans téléphone où vous vous concentrez l'un sur l'autre.",
            "Planifiez une escapade le week-end pour passer du temps ininterrompu ensemble.",
            "Jouez à un jeu de société ou travaillez ensemble sur un puzzle.",
            "Cuisinez un repas ensemble et profitez-en pour vous rapprocher."
        ]
    },
    "5": {
        "style": "Recevoir des Cadeaux",
        "description": "Recevoir des cadeaux implique d'exprimer son amour par des présents attentionnés qui montrent à votre partenaire que vous avez pensé à lui/elle. Ce n'est pas la valeur monétaire qui compte, mais le sentiment derrière le geste.",
        "dos": [
            "Offrez des cadeaux attentionnés qui montrent que vous avez pris en compte les préférences et les intérêts de votre partenaire.",
            "Surprenez votre partenaire avec de petits gestes significatifs qui montrent que vous pensez à lui/elle.",
            "Célébrez les occasions spéciales avec des présents symboliques ou personnalisés.",
            "Commémorez les jalons, les anniversaires et les dates importantes avec des cadeaux.",
            "Faites des cadeaux spontanés 'juste parce que' pour montrer que vous l'appréciez."
        ],
        "donts": [
            "Ne donnez pas de cadeaux impersonnels ou génériques sans valeur sentimentale.",
            "N'oubliez pas les dates ou les jalons importants qui comptent pour votre partenaire.",
            "Évitez de penser que des cadeaux chers sont toujours meilleurs, c'est l'intention qui compte.",
            "Ne supposez pas que les cadeaux doivent être matérialistes, ils peuvent être symboliques ou sentimentaux.",
            "Ne donnez pas de cadeaux uniquement lorsqu'on s'y attend—les gestes spontanés peuvent être plus significatifs."
        ],
        "howToCommunicate": [
            "Faites savoir à votre partenaire que recevoir des cadeaux vous fait vous sentir aimé(e) parce que cela montre réflexion et effort.",
            "Expliquez que ce n'est pas le prix du cadeau qui compte, mais la pensée derrière celui-ci.",
            "Dites que recevoir des cadeaux, même de petits gestes, vous fait vous sentir apprécié(e) et valorisé(e).",
            "Demandez-lui de prêter attention à vos centres d'intérêt et de vous surprendre occasionnellement avec des cadeaux réfléchis.",
            "Rassurez-le/la que les cadeaux sentimentaux et significatifs, comme une collation préférée ou une note écrite à la main, sont ceux qui comptent le plus pour vous."
        ],
        "commonMisunderstandings": [
            "Certaines personnes pensent que ceux qui valorisent les cadeaux sont matérialistes, mais c'est vraiment l'intention et l'effort derrière le cadeau qui comptent.",
            "On pense à tort que les cadeaux doivent être chers, alors qu'en réalité c'est leur signification émotionnelle qui importe.",
            "Les gens peuvent penser que recevoir des cadeaux ne concerne que les occasions spéciales, mais les gestes spontanés sont tout aussi importants.",
            "Les partenaires peuvent croire qu'après avoir donné un gros cadeau, ils n'ont plus besoin d'en faire, mais de petits gestes réguliers sont précieux.",
            "Certains pensent que les cadeaux sont purement matériels, mais ils peuvent symboliser l'amour, l'attention et la réflexion."
        ],
        "tips": [
            "Faites attention aux choses que votre partenaire mentionne vouloir ou avoir besoin, et surprenez-le/la avec plus tard.",
            "Gardez une liste de ce qui rend votre partenaire heureux, et utilisez-la pour choisir des cadeaux.",
            "Envisagez de donner des cadeaux qui se rapportent à des souvenirs partagés, comme un album photo ou un souvenir.",
            "Personnalisez les cadeaux pour refléter les intérêts ou les préférences uniques de votre partenaire.",
            "Surprenez votre partenaire avec de petits cadeaux attentionnés comme sa collation préférée ou un livre qu'il/elle voulait."
        ],
        "examples": [
            "Offrez un livre de son auteur préféré, montrant que vous vous souvenez de ses goûts.",
            "Surprenez votre partenaire avec sa collation préférée ou des fleurs après une longue journée.",
            "Célébrez un anniversaire en offrant quelque chose de significatif pour votre relation, comme une photo encadrée.",
            "Achetez des billets pour un événement qui l'excite, comme un concert ou un spectacle.",
            "Donnez un cadeau personnalisé, comme un bijou gravé ou un souvenir personnalisé."
        ]
    }
}