{
    "1": {
        "style": "Physical Touch",
        "description": "Physical touch involves showing love through physical affection such as hugs, kisses, cuddling, and even simple gestures like a pat on the back or a hand on the shoulder. It's a non-verbal way of showing affection and bonding.",
        "dos": [
            "Hold hands in public and private settings.",
            "Give long, warm hugs regularly to show affection.",
            "Offer comforting physical contact during stressful times.",
            "Cuddle together during downtime or before bed.",
            "Give spontaneous kisses, back rubs, or gentle touches."
        ],
        "donts": [
            "Avoid being physically distant or neglecting touch.",
            "Refrain from using physical touch as a punishment (e.g., withholding affection).",
            "Don’t assume all physical touch needs to be sexual.",
            "Avoid rough or careless physical contact.",
            "Neglect the small moments of physical affection, like hand-holding."
        ],
        "howToCommunicate": [
            "Tell your partner that physical closeness makes you feel loved and connected.",
            "Express the importance of non-sexual touch, like cuddling and holding hands.",
            "Let your partner know when you’re feeling disconnected due to a lack of physical affection.",
            "Reassure them that simple gestures of touch, like a hug or a kiss, can go a long way for you.",
            "Explain that physical touch comforts you in times of stress or anxiety."
        ],
        "commonMisunderstandings": [
            "People may assume physical touch is purely sexual, but it's about non-verbal emotional connection.",
            "Some may think that if they aren’t naturally 'touchy,' their partner won’t miss it.",
            "It can be misunderstood that quantity of touch is more important than quality.",
            "Those who value physical touch may seem needy when they’re only seeking connection.",
            "Partners may believe that occasional touch is enough, when consistency is key."
        ],
        "tips": [
            "Touch your partner throughout the day with small gestures, like a quick hug or pat on the back.",
            "Initiate affectionate physical contact, even if your partner doesn’t always ask for it.",
            "Use physical touch to reconnect after an argument or during stressful situations.",
            "Keep the physical affection varied—hugs, kisses, hand-holding, and cuddling are all important.",
            "Pay attention to your partner’s comfort level and adjust your touches accordingly."
        ],
        "examples": [
            "Hug your partner as soon as you see them after a long day.",
            "Hold hands while walking or watching TV together.",
            "Cuddle on the couch while watching a movie.",
            "Give your partner a back rub or massage to relax them.",
            "Offer comforting touch like a hand on their shoulder during a tough conversation."
        ]
    },
    "2": {
        "style": "Words of Affirmation",
        "description": "Words of affirmation involve expressing love and appreciation through verbal or written communication, offering encouragement, compliments, and positive reinforcement to uplift your partner.",
        "dos": [
            "Give sincere compliments about their personality, appearance, or accomplishments.",
            "Offer words of encouragement when they are pursuing their goals.",
            "Express gratitude frequently for their efforts, both big and small.",
            "Write thoughtful notes or texts to show your appreciation.",
            "Tell your partner regularly how much they mean to you and why."
        ],
        "donts": [
            "Avoid harsh criticism or negative language that can hurt your partner deeply.",
            "Refrain from using sarcasm or jokes at their expense.",
            "Don’t belittle their emotions or dismiss their feelings.",
            "Avoid withholding kind words when they seek verbal reassurance.",
            "Never use words as a weapon to manipulate or control them."
        ],
        "howToCommunicate": [
            "Let your partner know that you feel loved when they verbally express their appreciation.",
            "Explain that hearing positive, affirming words lifts your mood and strengthens your bond.",
            "Ask them to share compliments or gratitude with you regularly, especially when you’re feeling down.",
            "Reassure them that even small compliments or texts can make a big difference.",
            "Tell them that words of encouragement help motivate you and make you feel valued."
        ],
        "commonMisunderstandings": [
            "Some people think that words of affirmation are superficial or just flattery.",
            "Others may assume that you already know they care and don’t need to hear it.",
            "Some partners may think that once they say 'I love you,' they don’t need to say it often.",
            "Words of affirmation may be seen as unnecessary if the partner is more action-oriented.",
            "People may misunderstand that words are not just about praise but also include emotional support."
        ],
        "tips": [
            "Leave surprise love notes or thoughtful messages in places your partner will find them.",
            "Be specific in your compliments—this shows that you're truly paying attention.",
            "Make it a habit to say something positive every day, even during tough times.",
            "Use text messages to send little reminders of your appreciation throughout the day.",
            "Listen closely to what your partner says they value, and acknowledge it verbally."
        ],
        "examples": [
            "Say 'I appreciate how hard you work to support us' after a long workday.",
            "Leave a note in their bag or car saying, 'You’re amazing, and I’m lucky to have you.'",
            "Compliment their outfit or hair before going out together.",
            "Text them during the day to let them know you’re thinking of them.",
            "Celebrate their achievements with encouraging words like 'I’m so proud of you!'"
        ]
    },
    "3": {
        "style": "Acts of Service",
        "description": "Acts of service involve showing love by performing helpful actions for your partner, such as doing chores, running errands, or handling responsibilities to ease their burden.",
        "dos": [
            "Help with daily tasks like cooking, cleaning, or running errands without being asked.",
            "Offer to take on responsibilities that your partner finds stressful or time-consuming.",
            "Look for opportunities to ease their load, such as organizing something or planning ahead.",
            "Complete tasks or projects they’ve mentioned wanting done but haven’t had the time for.",
            "Be proactive—anticipate their needs and take action before they have to ask."
        ],
        "donts": [
            "Don’t make promises to help and then fail to follow through.",
            "Avoid doing things grudgingly or with resentment—your attitude matters.",
            "Don’t assume that one grand gesture will outweigh consistent smaller acts.",
            "Refrain from expecting praise for every small task—do it out of love, not for acknowledgment.",
            "Avoid criticizing how your partner does things if they offer to help."
        ],
        "howToCommunicate": [
            "Tell your partner that you feel loved when they help with everyday tasks or take on responsibilities.",
            "Explain that actions like handling chores or errands show you they care about your well-being.",
            "Ask them to pitch in with specific tasks, framing it as a way to support you emotionally.",
            "Let them know that small acts of service, like preparing a meal or running an errand, mean a lot to you.",
            "Reassure them that their efforts don’t have to be grand gestures—small, consistent actions are what matter most."
        ],
        "commonMisunderstandings": [
            "Some people think acts of service are just about doing chores, but it’s about making your partner’s life easier.",
            "Partners may misunderstand that offering help without being asked can show love.",
            "It can be assumed that acts of service are only about practical tasks, but emotional support through action is key.",
            "Some think that if their partner didn’t ask for help, they don’t need it, but anticipating needs is important.",
            "People may believe that their own efforts are unnoticed, when in fact they’re deeply appreciated."
        ],
        "tips": [
            "Make your partner’s favorite meal as a surprise on a tough day.",
            "Offer to take over a task or responsibility that’s weighing on them.",
            "Think ahead about things you can do to make their day easier, like filling up the car with gas or picking up groceries.",
            "Do small, thoughtful tasks regularly to show you’re always thinking about how to make their life better.",
            "Offer to help with tasks you know they dislike, like folding laundry or taking out the trash."
        ],
        "examples": [
            "Prepare dinner for them when you know they’ve had a long day.",
            "Take care of a home repair that’s been on their to-do list for a while.",
            "Wash the dishes or do the laundry without being asked.",
            "Run an errand they’ve been dreading, like going to the post office.",
            "Organize their workspace or a cluttered room to give them peace of mind."
        ]
    },
    "4": {
        "style": "Quality Time",
        "description": "Quality time involves giving your partner undivided attention, spending meaningful moments together, and sharing experiences that strengthen your connection.",
        "dos": [
            "Plan regular dates or activities that allow for meaningful conversation.",
            "Put away distractions, like your phone, and focus entirely on your partner.",
            "Engage in activities you both enjoy, such as cooking, hiking, or playing games together.",
            "Ask open-ended questions that encourage your partner to share their thoughts and feelings.",
            "Show interest in their hobbies and find ways to participate together."
        ],
        "donts": [
            "Avoid multitasking when spending time together (e.g., checking your phone).",
            "Don’t neglect regular one-on-one time, even when life gets busy.",
            "Refrain from being passive or disinterested during shared activities.",
            "Don’t let distractions or interruptions pull your focus away from your partner.",
            "Avoid rescheduling or canceling plans often—it can make your partner feel unimportant."
        ],
        "howToCommunicate": [
            "Let your partner know that you feel most loved when they dedicate time solely to you.",
            "Explain that undivided attention, even for a short time, makes you feel valued and appreciated.",
            "Ask for regular moments where you both can disconnect from distractions and focus on each other.",
            "Share with them that simple activities, like talking or sharing a meal, strengthen your bond.",
            "Reassure them that the quality of time spent matters more than the quantity."
        ],
        "commonMisunderstandings": [
            "People often think quality time is about quantity, but it’s more about emotional presence.",
            "Some partners may assume that spending time in the same room is enough, but focused attention is what matters.",
            "It’s misunderstood that quality time has to involve extravagant dates—simple moments are equally valuable.",
            "Partners may think that passive activities, like watching TV together, fulfill the need for quality time, but active engagement is key.",
            "Some may think that talking about daily tasks counts as quality time, but it’s about deeper connection."
        ],
        "tips": [
            "Set aside time each week for a 'no phone' date or activity together.",
            "Schedule a day trip or adventure where you can both experience something new.",
            "Surprise your partner with a planned date or activity they enjoy.",
            "Engage in their hobbies or interests, even if they’re different from yours.",
            "Plan a 'staycation' where you spend uninterrupted time together at home."
        ],
        "examples": [
            "Go for a long walk together and talk about your day or dreams.",
            "Have a tech-free dinner where you focus on each other.",
            "Plan a weekend getaway to spend uninterrupted time together.",
            "Play a board game or work on a puzzle together.",
            "Cook a meal together and use it as an opportunity to bond."
        ]
    },
    "5": {
        "style": "Receiving Gifts",
        "description": "Receiving gifts involves expressing love through thoughtful presents that show your partner you’ve been thinking about them. It’s less about the monetary value and more about the sentiment behind the gesture.",
        "dos": [
            "Give thoughtful gifts that show you’ve considered your partner’s preferences and interests.",
            "Surprise your partner with small, meaningful tokens that show you’re thinking of them.",
            "Celebrate special occasions with symbolic or personalized presents.",
            "Commemorate milestones, anniversaries, and important dates with gifts.",
            "Offer spontaneous gifts 'just because' to show you appreciate them."
        ],
        "donts": [
            "Don’t give thoughtless or generic gifts without any sentimental value.",
            "Avoid forgetting important dates or milestones that matter to your partner.",
            "Refrain from thinking that expensive gifts are always better—it’s the thought that counts.",
            "Don’t assume gifts have to be materialistic; they can be symbolic or sentimental.",
            "Avoid giving gifts only when it’s expected—spontaneous gestures can be more meaningful."
        ],
        "howToCommunicate": [
            "Let your partner know that receiving gifts makes you feel loved because it shows thought and effort.",
            "Explain that it’s not about the price of the gift, but the thoughtfulness behind it that matters to you.",
            "Share that receiving gifts, even small ones, makes you feel appreciated and valued.",
            "Ask them to pay attention to your interests and surprise you with thoughtful presents occasionally.",
            "Reassure them that sentimental and meaningful gifts, like a favorite snack or a handwritten note, mean the most to you."
        ],
        "commonMisunderstandings": [
            "Some people think that those who value gifts are materialistic, but it’s really about the thought and effort behind the gift.",
            "It’s misunderstood that gifts have to be expensive, when in reality it’s about the emotional significance.",
            "People may assume that receiving gifts is only for special occasions, but spontaneous gestures are equally important.",
            "Partners may believe that if they’ve given one big gift, they don’t need to do more, but small, regular tokens are valuable.",
            "Some may think that gifts are purely material, but they can symbolize love, care, and thoughtfulness."
        ],
        "tips": [
            "Pay attention to things your partner mentions wanting or needing and surprise them with it later.",
            "Keep a list of things that make your partner happy, and use it to pick out gifts.",
            "Consider giving gifts that relate to shared memories, like a photo album or keepsake.",
            "Personalize gifts to reflect your partner’s unique interests or preferences.",
            "Surprise your partner with small, thoughtful gifts like their favorite treat or a book they’ve been wanting."
        ],
        "examples": [
            "Give a book by their favorite author, showing you remembered their interests.",
            "Surprise your partner with their favorite snack or flowers after a long day.",
            "Celebrate an anniversary by gifting something meaningful from your relationship, like a framed photo.",
            "Buy tickets to an event they’ve been excited about, like a concert or show.",
            "Give a personalized gift, like a custom piece of jewelry or an engraved keepsake."
        ]
    }
}